tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
bool sameWaterRecordIdentity(const WaterRecord& a, const WaterRecord& b) {
    return a.startTime == b.startTime && a.volumeMl == b.volumeMl && a.targetValue == b.targetValue &&
           a.pulseCount == b.pulseCount && a.durationSec == b.durationSec && a.selectedPreset == b.selectedPreset &&
           a.result == b.result;
}

std::uint32_t historicalPulsePerLiter(float pulsePerMlAtRun) {
    if (!std::isfinite(pulsePerMlAtRun) || pulsePerMlAtRun <= 0.0f) {
        return 0;
    }
    return static_cast<std::uint32_t>(std::lround(pulsePerMlAtRun * 1000.0f));
}

std::uint32_t estimateVolumeMlFromPulses(std::uint32_t pulseCount, const MeteringParameters& params) {
    if (pulseCount == 0 || params.stablePulsePerLiter == 0) {
        return 0;
    }
    if (params.startupPulseCount > 0 && pulseCount <= params.startupPulseCount) {
        return static_cast<std::uint32_t>(
            (static_cast<std::uint64_t>(pulseCount) * params.startupVolumeMl + params.startupPulseCount / 2ULL) /
            params.startupPulseCount);
    }
    const std::uint32_t stablePulses =
        pulseCount > params.startupPulseCount ? pulseCount - params.startupPulseCount : pulseCount;
    const std::uint64_t stableMl =
        (static_cast<std::uint64_t>(stablePulses) * 1000ULL + params.stablePulsePerLiter / 2ULL) /
        params.stablePulsePerLiter;
    const std::uint64_t total = static_cast<std::uint64_t>(params.startupVolumeMl) + stableMl;
    return total > UINT32_MAX ? UINT32_MAX : static_cast<std::uint32_t>(total);
}

bool findRecordCalibration(const WaterRecord& record, WaterRecordCalibration& calibration) {
    return g_context.recordCalibrations && g_context.recordCalibrations->ready() &&
           g_context.recordCalibrations->find(record, calibration);
}

bool findRecordMeteringSnapshot(const WaterRecord& record, WaterRecordMeteringSnapshot& snapshot) {
    return g_context.recordMeteringSnapshots && g_context.recordMeteringSnapshots->ready() &&
           g_context.recordMeteringSnapshots->find(record, snapshot);
}

bool meteringParamsForRecordTrend(const WaterRecord& record, MeteringParameters& params) {
    WaterRecordMeteringSnapshot snapshot{};
    if (findRecordMeteringSnapshot(record, snapshot) && validMeteringSchemeParameters(snapshot.params)) {
        params = snapshot.params;
        return true;
    }
    const std::uint32_t pulsePerLiter = historicalPulsePerLiter(record.pulsePerMlAtRun);
    const MeteringParameters fallback{0, 0, pulsePerLiter};
    if (!validMeteringSchemeParameters(fallback)) {
        return false;
    }
    params = fallback;
    return true;
}

std::uint32_t actualMlForSegmentedSample(const WaterPulseTrace& trace) {
    if (trace.actualMl > 0) {
        return trace.actualMl;
    }
    WaterRecordCalibration calibration{};
    return findRecordCalibration(trace.record, calibration) ? calibration.actualMl : 0;
}

void indexPagePulseTraces(const WaterRecord* records,
                          std::size_t recordCount,
                          const WaterPulseTraceStore* store,
                          const WaterPulseTrace** output) {
    if (!output) {
        return;
    }
    for (std::size_t i = 0; i < recordCount; ++i) {
        output[i] = nullptr;
    }
    if (!records || !store || recordCount == 0) {
        return;
    }
    const std::size_t traceCount = store->count();
    for (std::size_t traceIndex = 0; traceIndex < traceCount; ++traceIndex) {
        const WaterPulseTrace* trace = store->traceAt(traceIndex);
        if (!trace || !trace->finished) {
            continue;
        }
        for (std::size_t i = 0; i < recordCount; ++i) {
            if (!output[i] && sameWaterRecordIdentity(trace->record, records[i])) {
                output[i] = trace;
            }
        }
    }
}

std::uint32_t measuredPulsePerLiter(const WaterRecord& record, const WaterRecordCalibration& calibration) {
    if (record.pulseCount == 0 || calibration.actualMl == 0) {
        return 0;
    }
    return static_cast<std::uint32_t>(
        (static_cast<std::uint64_t>(record.pulseCount) * 1000ULL + calibration.actualMl / 2ULL) /
        calibration.actualMl);
}

bool saveRecordActualMeasurement(const WaterRecord& record, std::uint32_t actualMl) {
    if (!g_context.config || !g_context.recordCalibrationWriter) {
        return false;
    }
    WaterRecordCalibration calibration = makeWaterRecordCalibration(record);
    calibration.actualMl = actualMl;
    calibration.calibratedAt = g_context.nowSeconds ? g_context.nowSeconds() : 0;
    MeteringSchemeRecord activeScheme{};
    const MeteringParameters params =
        activeMeteringSchemeForWeb(activeScheme) ? activeScheme.params : defaultMeteringParameters();
    const float stablePulsePerMl = static_cast<float>(params.stablePulsePerLiter) / 1000.0f;
    calibration.oldPulsePerMl = stablePulsePerMl;
    calibration.newPulsePerMl = stablePulsePerMl;
    calibration.oldStartupCompensationMl = 0;
    calibration.newStartupCompensationMl = 0;
    calibration.kind = WaterRecordCalibrationKind::PulsePerMl;
    return g_context.recordCalibrationWriter->upsert(calibration);
}

bool ensureSavedPulseTracesReady() {
    if (!g_context.savedPulseTraces) {
        return false;
    }
    return g_context.savedPulseTraces->ready() || g_context.savedPulseTraces->begin();
}

bool syncTraceActualMeasurement(const WaterRecord& record, std::uint32_t actualMl) {
    bool updated = false;
    if (g_context.pulseTraces && g_context.pulseTraces->setActualMlByRecord(record, actualMl)) {
        updated = true;
    }
    if (ensureSavedPulseTracesReady()) {
        WaterPulseTrace savedTrace{};
        if (g_context.savedPulseTraces->findByRecord(record, savedTrace)) {
            updated = g_context.savedPulseTraces->setActualMl(savedTrace.traceId, actualMl) || updated;
        }
    }
    return updated;
}

bool copyRamTraceSamples(const WaterPulseTrace& trace, WaterPulseTraceSample* output, std::size_t outputCapacity) {
    if (!g_context.pulseTraces || !output || outputCapacity < trace.sampleCount) {
        return false;
    }
    for (std::size_t i = 0; i < trace.sampleCount; ++i) {
        const WaterPulseTraceSample* sample = g_context.pulseTraces->sampleAt(trace, i);
        if (!sample) {
            return false;
        }
        output[i] = *sample;
    }
    return true;
}

bool copySavedTraceSamples(const WaterPulseTrace& trace, WaterPulseTraceSample* output, std::size_t outputCapacity) {
    return g_context.savedPulseTraces && output && outputCapacity >= trace.sampleCount &&
           g_context.savedPulseTraces->readSamples(trace.traceId, output, outputCapacity) == trace.sampleCount;
}

bool stablePulsePerSecFromTrace(const WaterPulseTrace& trace, bool savedSource, float& stablePulsePerSec) {
    stablePulsePerSec = 0.0f;
    if (!trace.finished || trace.truncated || trace.resumedAfterPause || trace.sampleCount < 6 || trace.totalPulses == 0) {
        return false;
    }
    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace.sampleCount]{};
    if (!samples) {
        return false;
    }
    const bool copied = savedSource ? copySavedTraceSamples(trace, samples, trace.sampleCount)
                                    : copyRamTraceSamples(trace, samples, trace.sampleCount);
    if (copied) {
        const WaterPulseTraceAnalysis analysis =
            analyzeWaterPulseTrace(trace, samples, trace.sampleCount, calibrationOptionsForWeb());
        if (analysis.stable && analysis.stablePulsePerSec > 0.0f) {
            stablePulsePerSec = analysis.stablePulsePerSec;
        }
    }
    delete[] samples;
    return stablePulsePerSec > 0.0f;
}

float recentStablePulsePerSec() {
    const StablePulseEstimateCache key = stablePulseCacheKey();
    if (stablePulseCacheMatches(key)) {
        return g_stablePulseEstimateCache.valid ? g_stablePulseEstimateCache.stablePulsePerSec : 0.0f;
    }
    float stablePulsePerSec = 0.0f;
    if (g_context.pulseTraces) {
        for (std::size_t offset = 0; offset < g_context.pulseTraces->count(); ++offset) {
            const std::size_t index = g_context.pulseTraces->count() - 1 - offset;
            const WaterPulseTrace* trace = g_context.pulseTraces->traceAt(index);
            if (trace && stablePulsePerSecFromTrace(*trace, false, stablePulsePerSec)) {
                g_stablePulseEstimateCache = key;
                g_stablePulseEstimateCache.ready = true;
                g_stablePulseEstimateCache.valid = true;
                g_stablePulseEstimateCache.stablePulsePerSec = stablePulsePerSec;
                return stablePulsePerSec;
            }
        }
    }
    if (!ensureSavedPulseTracesReady()) {
        g_stablePulseEstimateCache = key;
        g_stablePulseEstimateCache.ready = true;
        g_stablePulseEstimateCache.valid = false;
        return 0.0f;
    }
    const WaterPulseTraceFileStats stats = g_context.savedPulseTraces->stats();
    const std::size_t maxToRead = std::min<std::size_t>(stats.savedCount, kDefaultRecordPageSize);
    if (maxToRead == 0) {
        g_stablePulseEstimateCache = stablePulseCacheKey();
        g_stablePulseEstimateCache.ready = true;
        g_stablePulseEstimateCache.valid = false;
        return 0.0f;
    }
    WaterPulseTrace* traces = new (std::nothrow) WaterPulseTrace[maxToRead]{};
    if (!traces) {
        g_stablePulseEstimateCache = stablePulseCacheKey();
        g_stablePulseEstimateCache.ready = true;
        g_stablePulseEstimateCache.valid = false;
        return 0.0f;
    }
    const std::size_t count = g_context.savedPulseTraces->list(traces, maxToRead);
    for (std::size_t i = 0; i < count; ++i) {
        if (stablePulsePerSecFromTrace(traces[i], true, stablePulsePerSec)) {
            delete[] traces;
            g_stablePulseEstimateCache = stablePulseCacheKey();
            g_stablePulseEstimateCache.ready = true;
            g_stablePulseEstimateCache.valid = true;
            g_stablePulseEstimateCache.stablePulsePerSec = stablePulsePerSec;
            return stablePulsePerSec;
        }
    }
    delete[] traces;
    g_stablePulseEstimateCache = stablePulseCacheKey();
    g_stablePulseEstimateCache.ready = true;
    g_stablePulseEstimateCache.valid = false;
    return 0.0f;
}

bool firstSecondsPulseTotal(const WaterPulseTrace& trace,
                            bool savedSource,
                            std::uint32_t seconds,
                            std::uint32_t& totalPulses) {
    totalPulses = 0;
    if (seconds == 0 || trace.sampleCount == 0) {
        return true;
    }
    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace.sampleCount]{};
    if (!samples) {
        return false;
    }
    const bool copied = savedSource ? copySavedTraceSamples(trace, samples, trace.sampleCount)
                                    : copyRamTraceSamples(trace, samples, trace.sampleCount);
    if (copied) {
        std::size_t count = 0;
        const std::uint32_t endUs = seconds * 1000000UL;
        while (count < trace.sampleCount && samples[count].elapsedUs < endUs) {
            ++count;
        }
        totalPulses = effectivePulseCount(trace, samples, count);
    }
    delete[] samples;
    return copied;
}

