tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
bool segmentedSampleAlreadySeen(const WaterRecord* records, std::size_t count, const WaterRecord& record) {
    for (std::size_t i = 0; i < count; ++i) {
        if (sameWaterRecordIdentity(records[i], record)) {
            return true;
        }
    }
    return false;
}

bool appendSegmentedSampleFromTrace(const WaterPulseTrace& trace,
                                    bool savedSource,
                                    const SegmentedCalibrationOptions& options,
                                    SegmentedCalibrationSample* samples,
                                    WaterRecord* seenRecords,
                                    std::size_t& seenCount,
                                    std::size_t& sampleCount,
                                    SegmentedSampleDiagnostics& diagnostics) {
    if (!samples || !seenRecords || seenCount >= kSegmentedCalibrationMaxSamples ||
        segmentedSampleAlreadySeen(seenRecords, seenCount, trace.record)) {
        return false;
    }
    seenRecords[seenCount] = trace.record;
    ++seenCount;

    const std::uint32_t actualMl = actualMlForSegmentedSample(trace);
    if (actualMl > 0) {
        ++diagnostics.measuredSampleCount;
    }
    if (sampleCount >= kSegmentedCalibrationMaxSamples || actualMl == 0 || trace.sampleCount < 6 ||
        trace.totalPulses == 0 || trace.truncated) {
        return false;
    }
    WaterPulseTraceSample* traceSamples = new (std::nothrow) WaterPulseTraceSample[trace.sampleCount]{};
    if (!traceSamples) {
        return false;
    }
    const bool copied = savedSource ? copySavedTraceSamples(trace, traceSamples, trace.sampleCount)
                                    : copyRamTraceSamples(trace, traceSamples, trace.sampleCount);
    if (!copied) {
        delete[] traceSamples;
        return false;
    }
    const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(trace, traceSamples, trace.sampleCount, options);
    delete[] traceSamples;
    if (!analysis.stable || analysis.stablePulseCount == 0) {
        return false;
    }
    samples[sampleCount] = SegmentedCalibrationSample{
        actualMl,
        trace.totalPulses,
        analysis.startupPulseCount,
        analysis.stablePulseCount,
        analysis.stableStartSec,
    };
    if (trace.record.durationSec > 0) {
        diagnostics.validActualMlTotal += actualMl;
        diagnostics.validDurationSecTotal += trace.record.durationSec;
    }
    ++sampleCount;
    diagnostics.validSampleCount = static_cast<std::uint16_t>(sampleCount);
    if (trace.startTime >= diagnostics.latestSampleTime) {
        diagnostics.latestSampleTime = trace.startTime;
        diagnostics.latestActualMl = actualMl;
    }
    return true;
}

SegmentedSampleDiagnostics collectSegmentedSampleDiagnostics(bool includeRam) {
    SegmentedSampleDiagnostics diagnostics{};
    const SegmentedCalibrationOptions options = calibrationOptionsForWeb();
    SegmentedCalibrationSample* samples =
        new (std::nothrow) SegmentedCalibrationSample[kSegmentedCalibrationMaxSamples]{};
    WaterRecord* seenRecords = new (std::nothrow) WaterRecord[kSegmentedCalibrationMaxSamples]{};
    if (!samples || !seenRecords) {
        delete[] samples;
        delete[] seenRecords;
        return diagnostics;
    }
    std::size_t seenCount = 0;
    std::size_t sampleCount = 0;

    if (ensureSavedPulseTracesReady()) {
        WaterPulseTrace* savedTraces = new (std::nothrow) WaterPulseTrace[kSavedPulseTraceMaxCountLimit]{};
        if (savedTraces) {
            const std::size_t savedCount =
                g_context.savedPulseTraces->list(savedTraces, kSavedPulseTraceMaxCountLimit);
            diagnostics.savedTraceCount = static_cast<std::uint16_t>(
                std::min<std::size_t>(savedCount, static_cast<std::size_t>(UINT16_MAX)));
            for (std::size_t i = 0; i < savedCount && sampleCount < kSegmentedCalibrationMaxSamples; ++i) {
                appendSegmentedSampleFromTrace(
                    savedTraces[i], true, options, samples, seenRecords, seenCount, sampleCount, diagnostics);
            }
            delete[] savedTraces;
        }
    }

    if (includeRam && g_context.pulseTraces) {
        for (std::size_t offset = 0;
             offset < g_context.pulseTraces->count() && sampleCount < kSegmentedCalibrationMaxSamples;
             ++offset) {
            const std::size_t index = g_context.pulseTraces->count() - 1 - offset;
            const WaterPulseTrace* trace = g_context.pulseTraces->traceAt(index);
            if (trace) {
                appendSegmentedSampleFromTrace(*trace,
                                               false,
                                               options,
                                               samples,
                                               seenRecords,
                                               seenCount,
                                               sampleCount,
                                               diagnostics);
            }
        }
    }

    computeSegmentedCalibration(samples, sampleCount, options, diagnostics.result);
    diagnostics.validSampleCount = static_cast<std::uint16_t>(sampleCount);
    delete[] samples;
    delete[] seenRecords;
    return diagnostics;
}

bool saveRamTraceToDevice(std::uint32_t traceId,
                          std::uint32_t* savedTraceId,
                          WaterPulseTraceSaveStatus* status) {
    if (savedTraceId) {
        *savedTraceId = 0;
    }
    if (status) {
        *status = WaterPulseTraceSaveStatus::Ok;
    }
    if (!g_context.pulseTraces || !ensureSavedPulseTracesReady() || traceId == 0) {
        if (status) {
            *status = WaterPulseTraceSaveStatus::NotReady;
        }
        return false;
    }
    const WaterPulseTrace* trace = g_context.pulseTraces->findById(traceId);
    if (!trace || !trace->finished || trace->sampleCount == 0) {
        if (status) {
            *status = WaterPulseTraceSaveStatus::InvalidInput;
        }
        return false;
    }
    WaterRecordCalibration calibration{};
    if (findRecordCalibration(trace->record, calibration)) {
        g_context.pulseTraces->setActualMlByRecord(trace->record, calibration.actualMl);
        trace = g_context.pulseTraces->findById(traceId);
    }
    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace->sampleCount]{};
    if (!samples) {
        if (status) {
            *status = WaterPulseTraceSaveStatus::WriteFailed;
        }
        return false;
    }
    const bool copied = copyRamTraceSamples(*trace, samples, trace->sampleCount);
    const bool saved = copied && g_context.savedPulseTraces->save(*trace, samples, trace->sampleCount, savedTraceId, status);
    delete[] samples;
    return saved;
}

bool ensureMeteringSchemesReady() {
    return g_context.meteringSchemes && (g_context.meteringSchemes->ready() || g_context.meteringSchemes->begin());
}

