tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
const char* meteringSchemeSourceName(MeteringSchemeSource source) {
    switch (source) {
        case MeteringSchemeSource::Default:
            return "默认";
        case MeteringSchemeSource::Generated:
            return "样本生成";
        case MeteringSchemeSource::Manual:
            return "手工创建";
        case MeteringSchemeSource::Migrated:
            return "旧配置迁移";
    }
    return "-";
}

bool activeMeteringSchemeForWeb(MeteringSchemeRecord& output) {
    if (ensureMeteringSchemesReady() && g_context.meteringSchemes->activeScheme(output)) {
        return true;
    }
    if (g_context.app) {
        output = g_context.app->activeMeteringScheme();
        return output.valid;
    }
    return false;
}

bool meteringSchemeForSnapshot(const WaterRecordMeteringSnapshot& snapshot, MeteringSchemeRecord& output) {
    return ensureMeteringSchemesReady() && g_context.meteringSchemes->findById(snapshot.meteringSchemeId, output);
}

void sendMeteringSnapshotLabel(const WaterRecordMeteringSnapshot& snapshot, bool compact) {
    MeteringSchemeRecord scheme{};
    const bool schemeReady = meteringSchemeForSnapshot(snapshot, scheme);
    if (schemeReady && scheme.name[0]) {
        sendHtmlEscapedBounded(scheme.name, sizeof(scheme.name));
    } else {
        sendFmt("计量方案 %lu", static_cast<unsigned long>(snapshot.meteringSchemeId));
    }
    if (!compact) {
        sendFmt("<span class='inline-note'>ID #%lu · rev %lu</span>",
                static_cast<unsigned long>(snapshot.meteringSchemeId),
                static_cast<unsigned long>(snapshot.meteringSchemeRevision));
    }
}

bool storeSegmentedCandidate(const SegmentedCalibrationResult& result,
                             const SegmentedCalibrationOptions& options) {
    if (!ensureMeteringSchemesReady() || !result.valid) {
        return false;
    }
    MeteringSchemeCandidate candidate{};
    candidate.ready = true;
    candidate.params = MeteringParameters{result.startupPulseCount, result.startupVolumeMl, result.stablePulsePerLiter};
    candidate.generatedAt = g_context.nowSeconds ? g_context.nowSeconds() : 0;
    candidate.sampleCount = result.sampleCount;
    candidate.minActualMl = result.minActualMl;
    candidate.maxActualMl = result.maxActualMl;
    candidate.maxErrorMl = result.maxErrorMl;
    candidate.maxErrorPercent = static_cast<float>(result.maxRelativeErrorTenthPercent) / 10.0f;
    candidate.startupDurationMinSec = result.startupDurationSec;
    candidate.startupDurationMaxSec = result.startupDurationSec;
    candidate.startupDurationMedianSec = result.startupDurationSec;
    candidate.startupDurationAvgSec = result.startupDurationSec;
    std::snprintf(candidate.creationSummary,
                  sizeof(candidate.creationSummary),
                  "样本数量 %u，容量范围 %luml-%luml，最大误差 %luml，最大相对误差 %.1f%%，启动阶段平均 %lus。生成设置：分析脉冲间隔 %s，稳态窗口 %lus，稳态容差 %u%%。",
                  static_cast<unsigned>(result.sampleCount),
                  static_cast<unsigned long>(result.minActualMl),
                  static_cast<unsigned long>(result.maxActualMl),
                  static_cast<unsigned long>(result.maxErrorMl),
                  static_cast<double>(candidate.maxErrorPercent),
                  static_cast<unsigned long>(result.startupDurationSec),
                  options.pulseMinIntervalUsOverride == 0 ? "记录值" : "覆盖值",
                  static_cast<unsigned long>(options.stableWindowSec),
                  static_cast<unsigned>(options.stableTolerancePercent));
    return g_context.meteringSchemes->saveCandidate(candidate);
}

bool generateSegmentedCalibrationResultFromSavedSamples() {
    if (!g_context.config) {
        return false;
    }
    const SegmentedSampleDiagnostics diagnostics = collectSegmentedSampleDiagnostics(false);
    if (!diagnostics.result.valid) {
        return false;
    }
    return storeSegmentedCandidate(diagnostics.result, calibrationOptionsForWeb());
}

void sendSignedLiters(std::int32_t ml) {
    if (ml < 0) {
        Esp32BaseWeb::sendChunk("-");
        sendLiters(static_cast<std::uint32_t>(-ml));
        return;
    }
    Esp32BaseWeb::sendChunk("+");
    sendLiters(static_cast<std::uint32_t>(ml));
}

bool shouldShowTargetDelta(const WaterRecord& record) {
    if (record.mode != WaterMode::Volume || record.targetValue == 0) {
        return false;
    }
    const std::int32_t diff =
        static_cast<std::int32_t>(record.volumeMl) - static_cast<std::int32_t>(record.targetValue);
    const std::uint32_t absDiff = diff < 0 ? static_cast<std::uint32_t>(-diff) : static_cast<std::uint32_t>(diff);
    return absDiff >= 100UL && absDiff * 100UL >= record.targetValue * 3UL;
}

void sendTargetDeltaHint(const WaterRecord& record) {
    if (!shouldShowTargetDelta(record)) {
        return;
    }
    const std::int32_t diff =
        static_cast<std::int32_t>(record.volumeMl) - static_cast<std::int32_t>(record.targetValue);
    Esp32BaseWeb::sendChunk("<small class='hint'>较目标 ");
    sendSignedLiters(diff);
    Esp32BaseWeb::sendChunk("</small>");
}

const char* traceStateText(WaterPulseTraceState state) {
    switch (state) {
        case WaterPulseTraceState::Running:
            return "运行";
        case WaterPulseTraceState::Paused:
            return "暂停";
        case WaterPulseTraceState::Completed:
            return "完成";
        case WaterPulseTraceState::Stopped:
            return "停止";
        case WaterPulseTraceState::PauseTimeout:
            return "暂停超时";
        case WaterPulseTraceState::SafetyStopped:
            return "安全停止";
        case WaterPulseTraceState::Error:
        default:
            return "异常";
    }
}

void sendPlainTextResponse(int status, const char* body) {
    Esp32BaseWeb::sendResponseHeader("Cache-Control", "no-store");
    Esp32BaseWeb::sendResponseHeader("X-Content-Type-Options", "nosniff");
    if (!Esp32BaseWeb::beginResponse(status, "text/plain; charset=utf-8", nullptr)) {
        return;
    }
    Esp32BaseWeb::sendChunk(body ? body : "");
    Esp32BaseWeb::endResponse();
}

void sendDurationUs(std::uint32_t us) {
    if (us >= 1000000UL) {
        sendFmt("%lu.%03lu s",
                static_cast<unsigned long>(us / 1000000UL),
                static_cast<unsigned long>((us % 1000000UL) / 1000UL));
    } else if (us >= 1000UL) {
        sendFmt("%lu.%03lu ms",
                static_cast<unsigned long>(us / 1000UL),
                static_cast<unsigned long>(us % 1000UL));
    } else {
        sendFmt("%lu us", static_cast<unsigned long>(us));
    }
}

void sendDurationSeconds(std::uint32_t us) {
    sendFmt("%lu.%03lu 秒",
            static_cast<unsigned long>(us / 1000000UL),
            static_cast<unsigned long>((us % 1000000UL) / 1000UL));
}

std::size_t rawTracePreviewSampleCount(const WaterPulseTrace& trace) {
    const std::size_t previewLimit = kRawTracePreviewEdgeCount;
    return std::min(trace.sampleCount, previewLimit);
}

void sendPulseTraceRawText(const WaterPulseTrace& trace,
                           const WaterPulseTraceSample* samples,
                           bool rawTraceShowAll) {
    Esp32BaseWeb::sendResponseHeader("Cache-Control", "no-store");
    Esp32BaseWeb::sendResponseHeader("X-Content-Type-Options", "nosniff");
    if (!Esp32BaseWeb::beginResponse(200, "text/plain; charset=utf-8", nullptr)) {
        return;
    }
    Esp32BaseWeb::sendChunk("序号\t距任务开始(us)\t与上一边沿间隔(us)\t是否有效\t有效累计\n");
    std::uint32_t effectiveCumulative = 0;
    std::uint32_t lastEffectiveElapsedUs = 0;
    const std::size_t sampleCount = rawTraceShowAll ? trace.sampleCount : rawTracePreviewSampleCount(trace);
    for (std::size_t i = 0; i < sampleCount; ++i) {
        const std::uint32_t intervalUs = i == 0 ? 0 : samples[i].elapsedUs - samples[i - 1].elapsedUs;
        bool effective = i == 0;
        if (i > 0 && samples[i].elapsedUs >= lastEffectiveElapsedUs &&
            samples[i].elapsedUs - lastEffectiveElapsedUs >= trace.pulseMinIntervalUs) {
            effective = true;
        }
        if (effective) {
            ++effectiveCumulative;
            lastEffectiveElapsedUs = samples[i].elapsedUs;
        }
        sendFmt("%lu\t%lu\t%lu\t%s\t%lu\n",
                static_cast<unsigned long>(i),
                static_cast<unsigned long>(samples[i].elapsedUs),
                static_cast<unsigned long>(intervalUs),
                effective ? "有效" : "无效",
                static_cast<unsigned long>(effectiveCumulative));
    }
    if (!rawTraceShowAll && trace.sampleCount > sampleCount) {
        sendFmt("仅显示前 %lu 个原始边沿，共 %lu 行；完整明细请使用 all=1。\n",
                static_cast<unsigned long>(kRawTracePreviewEdgeCount),
                static_cast<unsigned long>(sampleCount));
    }
    Esp32BaseWeb::endResponse();
}

std::uint32_t bucketRunningPulseDelta(const WaterPulseTraceSample* samples,
                                      std::size_t sampleCount,
                                      const WaterPulseTraceBucket& bucket) {
    (void)samples;
    (void)sampleCount;
    return bucket.pulseDelta;
}

void formatKb(std::size_t bytes, char* out, std::size_t len) {
    const std::uint32_t tenths = static_cast<std::uint32_t>((bytes * 10U + 512U) / 1024U);
    std::snprintf(out, len, "%lu.%luKB", static_cast<unsigned long>(tenths / 10U),
                  static_cast<unsigned long>(tenths % 10U));
}

void sendSegmentedMeteringPanel() {
    MeteringSchemeRecord activeScheme{};
    const bool activeReady = activeMeteringSchemeForWeb(activeScheme);
    const MeteringParameters active = activeReady ? activeScheme.params : defaultMeteringParameters();
    char stable[24]{};
    char startupPulse[24]{};
    char startupVolume[24]{};
    std::snprintf(stable, sizeof(stable), "%luP/L", static_cast<unsigned long>(active.stablePulsePerLiter));
    std::snprintf(startupPulse, sizeof(startupPulse), "%luP", static_cast<unsigned long>(active.startupPulseCount));
    formatLiters(active.startupVolumeMl, startupVolume, sizeof(startupVolume));
    Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel metering-status-diagnostic'><div class='diagnostic-head'><h3>计量状态</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div><div class='diagnostic-metric-grid three'>",
            activeReady ? "status-ok" : "status-muted",
            activeReady ? "当前启用" : "无可用方案");
    Esp32BaseWeb::sendChunk("<div class='diagnostic-metric'><span>当前方案</span><strong>");
    if (activeReady) {
        sendHtmlEscapedBounded(activeScheme.name, sizeof(activeScheme.name));
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</strong></div>");
    sendFmt("<div class='diagnostic-metric'><span>稳态P/L</span><strong>%s</strong></div>", stable);
    sendFmt("<div class='diagnostic-metric'><span>启动脉冲数</span><strong>%s</strong></div>", startupPulse);
    sendFmt("<div class='diagnostic-metric'><span>启动水量</span><strong>%s</strong></div>", startupVolume);
    Esp32BaseWeb::sendChunk("</div><div class='diagnostic-foot'>");
    if (activeReady) {
        sendFmt("<span>ID <b>#%lu</b></span><span>修订 <b>rev %lu</b></span><span>出水记录 <b>%lu</b> 条</span>",
                static_cast<unsigned long>(activeScheme.id),
                static_cast<unsigned long>(activeScheme.revision),
                static_cast<unsigned long>(activeScheme.useCount));
    } else {
        Esp32BaseWeb::sendChunk("<span>ID <b>-</b></span><span>修订 <b>-</b></span><span>出水记录 <b>-</b> 条</span>");
    }
    Esp32BaseWeb::sendChunk("</div></section>");
}

void sendPulseTraceCachePanel() {
    WaterPulseTraceStats stats{};
    if (!g_context.pulseTraces) {
        Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel trace-cache-diagnostic'><div class='diagnostic-head'><h3>RAM 最近明细</h3>"
                                "<span class='status-pill status-error'>RAM 不可用</span></div>"
                                "<div class='diagnostic-metric-grid'><div class='diagnostic-metric'><span>最近明细</span><strong>-</strong></div>"
                                "<div class='diagnostic-metric'><span>RAM 数据点</span><strong>-</strong></div></div>"
                                "<div class='diagnostic-foot'><span>RAM 占用 <b>-</b></span><span>单条上限 <b>-</b></span></div></section>");
    } else {
        stats = g_context.pulseTraces->stats();
        char used[24]{};
        formatKb(stats.usedBytes, used, sizeof(used));
        char traces[24]{};
        char samples[32]{};
        std::snprintf(traces,
                      sizeof(traces),
                      "%lu / %lu 条",
                      static_cast<unsigned long>(stats.traceCount),
                      static_cast<unsigned long>(g_context.config ? g_context.config->recentPulseTraceCount : stats.traceCapacity));
        std::snprintf(samples,
                      sizeof(samples),
                      "%lu / %lu 点",
                      static_cast<unsigned long>(stats.sampleCount),
                      static_cast<unsigned long>(stats.sampleCapacity));
        Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel trace-cache-diagnostic'><div class='diagnostic-head'><h3>RAM 最近明细</h3>"
                                "<span class='status-pill status-muted ram-badge'>RAM</span></div><div class='diagnostic-metric-grid'>");
        sendFmt("<div class='diagnostic-metric'><span>最近明细</span><strong>%s</strong></div>", traces);
        sendFmt("<div class='diagnostic-metric'><span>RAM 数据点</span><strong>%s</strong></div>", samples);
        sendFmt("</div><div class='diagnostic-foot'><span>RAM 占用 <b>%s</b></span><span>单条上限 <b>%lu 点</b></span></div></section>",
                used,
                static_cast<unsigned long>(stats.sampleCapacityPerTrace));
    }

