tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    WaterPulseTraceFileStats savedStats{};
    const bool savedReady = ensureSavedPulseTracesReady();
    char savedCount[32]{};
    char savedSpace[48]{};
    std::snprintf(savedCount, sizeof(savedCount), "-");
    std::snprintf(savedSpace, sizeof(savedSpace), "-");
    if (savedReady) {
        savedStats = g_context.savedPulseTraces->stats();
        char savedUsed[24]{};
        char savedMax[24]{};
        std::snprintf(savedCount,
                      sizeof(savedCount),
                      "%lu / %lu 条",
                      static_cast<unsigned long>(savedStats.savedCount),
                      static_cast<unsigned long>(savedStats.maxCount));
        formatKb(savedStats.usedBytes, savedUsed, sizeof(savedUsed));
        formatKb(savedStats.maxBytes, savedMax, sizeof(savedMax));
        std::snprintf(savedSpace, sizeof(savedSpace), "%s / %s", savedUsed, savedMax);
    }
    Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel saved-trace-diagnostic'><div class='diagnostic-head'><h3>已保存明细</h3>"
                            "<span class='status-pill status-muted flash-badge'>Flash</span></div><div class='diagnostic-metric-grid'>");
    sendFmt("<div class='diagnostic-metric'><span>保存</span><strong>%s</strong></div>", savedCount);
    sendFmt("<div class='diagnostic-metric'><span>文件占用</span><strong>%s</strong></div>", savedSpace);
    if (savedReady) {
        sendFmt("</div><div class='diagnostic-foot'><span>单条最多 <b>%lu 点</b></span></div>",
                static_cast<unsigned long>(savedStats.sampleCapacityPerTrace));
    } else {
        Esp32BaseWeb::sendChunk("</div><div class='diagnostic-foot'><span>单条最多 <b>-</b></span></div>");
    }
    if (savedReady && savedStats.corrupt) {
        Esp32BaseWeb::sendChunk("<p class='err'>设备存储明细文件异常；不会影响启动和本次出水记录。</p>");
    }
    Esp32BaseWeb::sendChunk("</section>");
}

void sendCalibrationParameterPanels() {
    MeteringSchemeRecord* schemes = new (std::nothrow) MeteringSchemeRecord[10]{};
    const bool ready = ensureMeteringSchemesReady();
    const std::size_t count = ready && schemes ? g_context.meteringSchemes->list(schemes, 10, true) : 0;
    const std::uint32_t activeId = ready ? g_context.meteringSchemes->activeSchemeId() : 0;
    char createdText[24]{};
    std::uint32_t createdSchemeId = 0;
    if (getParam("createdScheme", createdText, sizeof(createdText))) {
        parseU32(createdText, createdSchemeId);
    }

    Esp32BaseWeb::sendChunk("<section class='panel calibration-param-panel'><div class='panel-head'><h3>流量计计量方案</h3>"
                            "<a class='btn-link' href='/faucet/calibration?scheme=new'>新建方案</a></div>"
                            "<table class='calibration-slot-table metering-scheme-table'><tr><th>方案</th><th>参数</th><th>适用条件</th><th>使用次数</th><th>操作</th></tr>");
    if (!ready) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='5'>计量方案存储不可用。</td></tr>");
    } else if (!schemes) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='5'>内存不足，无法加载方案列表。</td></tr>");
    }
    for (std::size_t i = 0; i < count; ++i) {
        const MeteringSchemeRecord& scheme = schemes[i];
        char startupVolume[24]{};
        formatLiters(scheme.params.startupVolumeMl, startupVolume, sizeof(startupVolume));
        sendFmt("<tr%s><td class='calibration-slot-index'><b>#%lu</b> ",
                scheme.id == createdSchemeId ? " class='scheme-created-row'" : "",
                static_cast<unsigned long>(scheme.id));
        if (scheme.id == activeId) {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-ok'>当前启用</span> ");
        }
        if (scheme.id == createdSchemeId) {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-warn'>刚保存</span> ");
        }
        if (!scheme.enabled) {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>已禁用</span> ");
        }
        Esp32BaseWeb::sendChunk("<div class='calibration-slot-name'>");
        sendHtmlEscapedBounded(scheme.name, sizeof(scheme.name));
        sendFmt("</div><small>rev %lu · %s</small></td>",
                static_cast<unsigned long>(scheme.revision),
                meteringSchemeSourceName(scheme.sourceType));
        sendFmt("<td class='calibration-slot-values'><span><b>启动脉冲</b>%luP</span><span><b>启动水量</b>%s</span><span><b>稳态</b>%luP/L</span></td>",
                static_cast<unsigned long>(scheme.params.startupPulseCount),
                startupVolume,
                static_cast<unsigned long>(scheme.params.stablePulsePerLiter));
        Esp32BaseWeb::sendChunk("<td class='calibration-slot-note'>");
        if (scheme.meterLabel[0]) {
            Esp32BaseWeb::sendChunk("流量计：");
            sendHtmlEscapedBounded(scheme.meterLabel, sizeof(scheme.meterLabel));
            Esp32BaseWeb::sendChunk("<br>");
        }
        if (scheme.conditionLabel[0]) {
            Esp32BaseWeb::sendChunk("环境：");
            sendHtmlEscapedBounded(scheme.conditionLabel, sizeof(scheme.conditionLabel));
            Esp32BaseWeb::sendChunk("<br>");
        }
        sendHtmlEscapedBounded(scheme.lastModifiedSummary[0] ? scheme.lastModifiedSummary : scheme.creationSummary,
                               scheme.lastModifiedSummary[0] ? sizeof(scheme.lastModifiedSummary)
                                                              : sizeof(scheme.creationSummary));
        Esp32BaseWeb::sendChunk("</td>");
        sendFmt("<td class='scheme-use-count'><b>%lu</b><span>条</span>%s</td><td class='calibration-slot-edit'><div class='row-actions'>",
                static_cast<unsigned long>(scheme.useCount),
                scheme.usageStatsDirty ? "<span class='status-pill status-warn'>统计待核对</span>" : "");
        sendFmt("<a class='btn-link' href='/faucet/calibration?scheme=%lu'>编辑</a>",
                static_cast<unsigned long>(scheme.id));
        if (scheme.id != activeId && scheme.enabled) {
            sendFmt("<form method='post' action='/faucet/calibration' onsubmit='return once(this)'><input type='hidden' name='action' value='enable_metering_scheme'><input type='hidden' name='id' value='%lu'><input class='primary' type='submit' value='%s'></form>",
                    static_cast<unsigned long>(scheme.id),
                    scheme.id == createdSchemeId ? "启用此方案" : "启用");
        }
        if (scheme.id != activeId && scheme.enabled) {
            sendFmt("<form method='post' action='/faucet/calibration' onsubmit=\"return confirm('确认禁用该计量方案？')&&once(this)\"><input type='hidden' name='action' value='disable_metering_scheme'><input type='hidden' name='id' value='%lu'><input class='secondary' type='submit' value='禁用'></form>",
                    static_cast<unsigned long>(scheme.id));
        }
        if (scheme.id != activeId && scheme.useCount == 0 && !scheme.usageStatsDirty) {
            sendFmt("<form method='post' action='/faucet/calibration' onsubmit=\"return confirm('确认删除未使用的计量方案？')&&once(this)\"><input type='hidden' name='action' value='delete_metering_scheme'><input type='hidden' name='id' value='%lu'><input class='danger' type='submit' value='删除'></form>",
                    static_cast<unsigned long>(scheme.id));
        }
        Esp32BaseWeb::sendChunk("</div></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table>");
    if (ready && count == 10) {
        Esp32BaseWeb::sendChunk("<p class='muted'>页面最多显示最近 10 套可见方案；历史记录仍按方案 ID 和版本保存。</p>");
    }
    Esp32BaseWeb::sendChunk("</section>");
    delete[] schemes;
}

void sendMeteringSchemeEditPage(bool creating, const MeteringSchemeRecord* scheme) {
    const char* title = creating ? "新建计量方案" : "修改计量方案";
    Esp32BaseWeb::sendHeader(title);
    sendFmt("<h2>%s</h2><p><a class='btn-link' href='/faucet/calibration'>返回校准</a></p>", title);
    sendNoticeFromQuery();
    const MeteringParameters params = scheme ? scheme->params : defaultMeteringParameters();
    const bool editingActive = !creating && scheme && ensureMeteringSchemesReady() &&
                               scheme->id == g_context.meteringSchemes->activeSchemeId();
    Esp32BaseWeb::sendChunk("<section class='panel calibration-param-panel scheme-edit-panel'><form class='scheme-edit-form' method='post' action='/faucet/calibration' onsubmit='return once(this)'>");
    Esp32BaseWeb::sendChunk(creating ? "<input type='hidden' name='action' value='create_metering_scheme'>"
                                     : "<input type='hidden' name='action' value='edit_metering_scheme'>");
    if (!creating && scheme) {
        sendFmt("<input type='hidden' name='id' value='%lu'>", static_cast<unsigned long>(scheme->id));
    }
    if (editingActive) {
        Esp32BaseWeb::sendChunk("<p class='warn scheme-edit-warning'>当前启用方案：保存后会立即影响后续出水估算。</p>");
    }
    Esp32BaseWeb::sendChunk("<div class='scheme-edit-section'><h3>方案信息</h3><div class='scheme-edit-grid'>");
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-12'><span>名称</span><input name='name' maxlength='%u' value='",
            static_cast<unsigned>(kMeteringSchemeNameLength - 1));
    if (scheme && scheme->name[0]) {
        sendHtmlAttrEscapedBounded(scheme->name, sizeof(scheme->name));
    } else {
        Esp32BaseWeb::sendChunk("手工方案");
    }
    Esp32BaseWeb::sendChunk("'></label>");
    if (!creating && scheme) {
        sendFmt("<div class='scheme-edit-meta scheme-span-12'><span>#%lu</span><span>rev %lu</span><span>%s</span></div>",
                static_cast<unsigned long>(scheme->id),
                static_cast<unsigned long>(scheme->revision),
                scheme->enabled ? "可用" : "已禁用");
    }
    Esp32BaseWeb::sendChunk("</div></div><div class='scheme-edit-section'><h3>核心计量参数</h3><div class='scheme-edit-grid'>");
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>启动脉冲数</span><input name='startupPulseCount' type='number' min='0' max='%lu' step='1' value='%lu'><small class='hint'>单位 P，范围 0-%lu</small></label>",
            static_cast<unsigned long>(kMaxSegmentedStartupPulseCount),
            static_cast<unsigned long>(params.startupPulseCount),
            static_cast<unsigned long>(kMaxSegmentedStartupPulseCount));
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>启动水量</span><input name='startupVolumeMl' type='number' min='0' max='%lu' step='1' value='%lu'><small class='hint'>单位 ml，范围 0-%lu</small></label>",
            static_cast<unsigned long>(kMaxSegmentedStartupVolumeMl),
            static_cast<unsigned long>(params.startupVolumeMl),
            static_cast<unsigned long>(kMaxSegmentedStartupVolumeMl));
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>稳态 P/L</span><input name='stablePulsePerLiter' type='number' min='%lu' max='%lu' step='1' value='%lu'><small class='hint'>单位 P/L，范围 %lu-%lu</small></label>",
            static_cast<unsigned long>(kMinSegmentedPulsePerLiter),
            static_cast<unsigned long>(kMaxSegmentedPulsePerLiter),
            static_cast<unsigned long>(params.stablePulsePerLiter),
            static_cast<unsigned long>(kMinSegmentedPulsePerLiter),
            static_cast<unsigned long>(kMaxSegmentedPulsePerLiter));
    Esp32BaseWeb::sendChunk("</div></div>");
    if (!creating && scheme) {
        Esp32BaseWeb::sendChunk("<div class='scheme-edit-section'><h3>适用条件</h3><div class='scheme-edit-grid'>");
        sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>流量计</span><input name='meterLabel' maxlength='%u' value='",
                static_cast<unsigned>(kMeteringSchemeMeterLabelLength - 1));
        sendHtmlAttrEscapedBounded(scheme->meterLabel, sizeof(scheme->meterLabel));
        sendFmt("'></label><label class='compact-field scheme-edit-field scheme-span-4'><span>安装位置</span><input name='installationLabel' maxlength='%u' value='",
                static_cast<unsigned>(kMeteringSchemeInstallationLabelLength - 1));
        sendHtmlAttrEscapedBounded(scheme->installationLabel, sizeof(scheme->installationLabel));
        sendFmt("'></label><label class='compact-field scheme-edit-field scheme-span-4'><span>水压/环境</span><input name='conditionLabel' maxlength='%u' value='",
                static_cast<unsigned>(kMeteringSchemeConditionLabelLength - 1));
        sendHtmlAttrEscapedBounded(scheme->conditionLabel, sizeof(scheme->conditionLabel));
        sendFmt("'></label><label class='compact-field scheme-edit-field scheme-span-12'><span>备注</span><input name='userNote' maxlength='%u' value='",
                static_cast<unsigned>(kMeteringSchemeUserNoteLength - 1));
        sendHtmlAttrEscapedBounded(scheme->userNote, sizeof(scheme->userNote));
        Esp32BaseWeb::sendChunk("'></label></div></div>");
    }
    Esp32BaseWeb::sendChunk(creating ? "<div class='form-actions scheme-edit-actions'><input class='primary' type='submit' value='保存为新方案'>"
                                     : "<div class='form-actions scheme-edit-actions'><input class='primary' type='submit' value='保存修改'>");
    Esp32BaseWeb::sendChunk("<a class='btn-link' href='/faucet/calibration'>取消</a></div></form></section>");
    sendPageEnd();
}


void sendCalibrationFormulaPanel() {
    Esp32BaseWeb::sendChunk("<section class='panel calibration-formula-panel'><h3>生成参数：样本与拟合</h3>"
                            "<table class='kv'>"
                            "<tr><th>有效样本条件</th><td>有脉冲明细、已写入设备样本库、容量已校准、原始边沿未因超过单条上限而被截断、未发生暂停后恢复出水且稳态识别成功的样本，才参与生成计量参数。</td></tr>"
                            "<tr><th>稳态识别</th><td>每条样本先从脉冲分布中识别稳态起点，得到启动脉冲数 Ns 样本值和稳态脉冲数。</td></tr>"
                            "<tr><th>生成拟合</th><td><code>实测容量 = Vs + 稳态脉冲数 × 每脉冲毫升数</code>，多条样本拟合得到启动水量 Vs 和稳态P/L。</td></tr>"
                            "<tr><th>生成参数</th><td><code>Ns = 平均启动脉冲数</code>；<code>Vs = 拟合得到的启动水量</code>；<code>Ps = round(1000 / 每脉冲毫升数)</code>。</td></tr>"
                            "<tr><th>生成结果</th><td>点击生成参数后只得到待保存结果；保存为新方案前不会改变当前计量。</td></tr>"
                            "</table></section>"
                            "<section class='panel calibration-formula-panel'><h3>出水估算：计量方案如何使用</h3>"
                            "<table class='kv'>"
                            "<tr><th>核心字段</th><td>运行时只使用启动脉冲数 Ns、启动水量 Vs、稳态P/L Ps。</td></tr>"
                            "<tr><th>P = 0</th><td><code>估算出水量 = 0</code>。</td></tr>"
                            "<tr><th>0 &lt; P &lt;= Ns</th><td><code>估算出水量 = round(P × Vs / Ns)</code>。</td></tr>"
                            "<tr><th>P &gt; Ns</th><td><code>估算出水量 = Vs + round((P - Ns) × 1000 / Ps)</code>。</td></tr>"
                            "<tr><th>启用方案</th><td>启用只切换当前计量参数；历史出水记录保留当时使用的方案 ID、版本和参数快照。</td></tr>"
                            "</table></section>");
}

