tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
const char* segmentedRejectReasonText(SegmentedCalibrationRejectReason reason) {
    switch (reason) {
        case SegmentedCalibrationRejectReason::None:
            return "";
        case SegmentedCalibrationRejectReason::NotEnoughSamples:
            return "可生成样本不足";
        case SegmentedCalibrationRejectReason::VolumeSpanTooSmall:
            return "容量跨度不足";
        case SegmentedCalibrationRejectReason::DegenerateFit:
            return "样本分布无法拟合";
        case SegmentedCalibrationRejectReason::InvalidFit:
            return "拟合结果无效";
        case SegmentedCalibrationRejectReason::ErrorTooHigh:
            return "拟合误差超限";
    }
    return "无法生成";
}

struct CalibrationSampleState {
    std::uint32_t actualMl = 0;
    std::uint32_t stableStartSec = 0;
    bool stable = false;
    bool qualityValid = false;
    bool truncated = false;
    bool resumedAfterPause = false;
};

CalibrationSampleState inspectCalibrationSample(const WaterPulseTrace& trace, bool savedSource) {
    CalibrationSampleState state{};
    state.actualMl = actualMlForSegmentedSample(trace);
    state.truncated = trace.truncated;
    state.resumedAfterPause = trace.resumedAfterPause;
    if (trace.truncated) {
        return state;
    }
    if (trace.sampleCount < 6 || trace.totalPulses == 0) {
        return state;
    }
    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace.sampleCount]{};
    if (!samples) {
        return state;
    }
    const bool copied = savedSource ? copySavedTraceSamples(trace, samples, trace.sampleCount)
                                    : copyRamTraceSamples(trace, samples, trace.sampleCount);
    if (copied) {
        const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(trace, samples, trace.sampleCount);
        state.stable = analysis.stable && analysis.stablePulseCount > 0;
        state.stableStartSec = analysis.stableStartSec;
        state.qualityValid = state.actualMl > 0 && state.stable;
    }
    delete[] samples;
    return state;
}

void sendCalibrationSampleStatusPills(const CalibrationSampleState& state, bool savedSource, const char* containerClass) {
    sendFmt("<span class='%s'>", containerClass);
    if (state.truncated) {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-warn'>明细已截断</span>"
                                "<span class='status-pill status-muted'>不入库</span>");
        Esp32BaseWeb::sendChunk("</span>");
        return;
    }
    if (state.actualMl == 0) {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>待校准容量</span>");
        if (state.resumedAfterPause) {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-warn'>暂停后恢复</span>");
        }
        Esp32BaseWeb::sendChunk("</span>");
        return;
    }
    Esp32BaseWeb::sendChunk("<span class='status-pill status-ok'>容量已校准</span>");
    if (state.resumedAfterPause) {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-warn'>暂停后恢复</span>");
        Esp32BaseWeb::sendChunk("</span>");
        return;
    }
    if (!state.stable) {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-warn'>稳态失败</span>");
        Esp32BaseWeb::sendChunk("</span>");
        return;
    }
    Esp32BaseWeb::sendChunk(savedSource ? "<span class='status-pill status-ok'>可参与生成</span>"
                                        : "<span class='status-pill status-warn'>可入库</span>");
    Esp32BaseWeb::sendChunk("</span>");
}

bool traceAlreadyListed(const WaterRecord* records, std::size_t count, const WaterRecord& record) {
    for (std::size_t i = 0; i < count; ++i) {
        if (sameWaterRecordIdentity(records[i], record)) {
            return true;
        }
    }
    return false;
}

bool generationResultRequested() {
    char text[32]{};
    if (getParam("generated", text, sizeof(text)) && std::strcmp(text, "1") == 0) {
        return true;
    }
    return getParam("saved", text, sizeof(text)) && std::strcmp(text, "generated") == 0;
}

bool calibrationContextRequested() {
    char text[24]{};
    return (getParam("from", text, sizeof(text)) && std::strcmp(text, "calibration") == 0) ||
           (getParam("returnTo", text, sizeof(text)) && std::strcmp(text, "calibration") == 0);
}

std::uint32_t selectedSamplePulseWindowSec() {
    char text[16]{};
    std::uint32_t seconds = kDefaultSamplePulseWindowSec;
    if (getParam("sampleSeconds", text, sizeof(text)) && parseU32(text, seconds)) {
        return std::min<std::uint32_t>(std::max<std::uint32_t>(seconds, kMinSamplePulseWindowSec),
                                       kMaxSamplePulseWindowSec);
    }
    return kDefaultSamplePulseWindowSec;
}

void sendTraceDetailLink(bool fromCalibration,
                         bool savedSource,
                         std::uint32_t traceId,
                         std::uint32_t bucket,
                         const char* label,
                         const char* className = "btn-link") {
    const char* detailPath = fromCalibration ? "/faucet/calibration/detail" : "/faucet/records/detail";
    sendFmt("<a class='%s' href='%s?%s%strace=%lu&bucket=%lu'>%s</a>",
            className,
            detailPath,
            fromCalibration ? "from=calibration&" : "",
            savedSource ? "saved=1&" : "",
            static_cast<unsigned long>(traceId),
            static_cast<unsigned long>(bucket),
            label);
}

bool readCalibrationTraceFromRequest(WaterPulseTrace& trace, bool& savedSource, std::uint32_t& traceId) {
    char text[32]{};
    trace = {};
    traceId = 0;
    savedSource = false;
    if (!getParam("trace", text, sizeof(text)) || !parseU32(text, traceId) || traceId == 0) {
        return false;
    }
    if (getParam("traceSource", text, sizeof(text))) {
        savedSource = std::strcmp(text, "saved") == 0;
    } else if (getParam("saved", text, sizeof(text))) {
        std::uint32_t savedValue = 0;
        savedSource = parseU32(text, savedValue) && savedValue != 0;
    }

    if (savedSource) {
        if (!ensureSavedPulseTracesReady() || !g_context.savedPulseTraces->findById(traceId, trace)) {
            return false;
        }
    } else {
        const WaterPulseTrace* ramTrace = g_context.pulseTraces ? g_context.pulseTraces->findById(traceId) : nullptr;
        if (!ramTrace) {
            return false;
        }
        trace = *ramTrace;
    }
    return trace.finished && trace.sampleCount > 0 && waterRecordCanCalibrate(trace.record);
}

bool ensureCalibratedTraceSaved(bool savedSource,
                                std::uint32_t traceId,
                                const WaterRecord& record,
                                std::uint32_t actualMl) {
    if (savedSource) {
        if (!ensureSavedPulseTracesReady() || !g_context.savedPulseTraces->setActualMl(traceId, actualMl)) {
            return false;
        }
        if (g_context.pulseTraces) {
            g_context.pulseTraces->setActualMlByRecord(record, actualMl);
        }
        return true;
    }
    if (!g_context.pulseTraces || !g_context.pulseTraces->setActualMl(traceId, actualMl)) {
        return false;
    }
    if (!ensureSavedPulseTracesReady()) {
        return false;
    }
    WaterPulseTrace savedTrace{};
    if (g_context.savedPulseTraces->findByRecord(record, savedTrace)) {
        return g_context.savedPulseTraces->setActualMl(savedTrace.traceId, actualMl);
    }
    std::uint32_t savedTraceId = 0;
    WaterPulseTraceSaveStatus status = WaterPulseTraceSaveStatus::Ok;
    return saveRamTraceToDevice(traceId, &savedTraceId, &status);
}

void sendCalibrationSampleRow(const WaterPulseTrace& trace, bool savedSource, std::uint32_t samplePulseWindowSec) {
    char startTime[40]{};
    formatWaterRecordListTime(trace.record, startTime, sizeof(startTime));
    const CalibrationSampleState state = inspectCalibrationSample(trace, savedSource);
    WaterRecordCalibration calibration{};
    const bool calibrated = findRecordCalibration(trace.record, calibration);
    const std::uint32_t defaultActualMl = state.actualMl > 0 ? state.actualMl : trace.record.volumeMl;
    std::uint32_t firstWindowPulses = 0;
    const bool firstWindowReady = firstSecondsPulseTotal(trace, savedSource, samplePulseWindowSec, firstWindowPulses);
    const char* sourceValue = savedSource ? "saved" : "ram";
    char rowId[32]{};
    std::snprintf(rowId,
                  sizeof(rowId),
                  "calibrate-%s-%lu",
                  sourceValue,
                  static_cast<unsigned long>(trace.traceId));
    Esp32BaseWeb::sendChunk("<tr><td>");
    Esp32BaseWeb::sendChunk(startTime);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendTargetValue(trace.record);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendLiters(trace.record.volumeMl);
    Esp32BaseWeb::sendChunk("</td><td>");
    if (state.actualMl > 0) {
        sendLitersMl(state.actualMl);
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    sendFmt("</td><td>%luP / %lu点</td><td>",
            static_cast<unsigned long>(trace.totalPulses),
            static_cast<unsigned long>(trace.sampleCount));
    if (firstWindowReady) {
        sendFmt("%luP", static_cast<unsigned long>(firstWindowPulses));
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    if (state.stable) {
        sendFmt("第 %lus", static_cast<unsigned long>(state.stableStartSec));
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    sendTraceDetailLink(true,
                        savedSource,
                        trace.traceId,
                        1,
                        savedSource ? "已保存到设备" : "RAM 中",
                        savedSource ? "trace-badge trace-source-link status-ok" : "trace-badge trace-source-link status-muted");
    Esp32BaseWeb::sendChunk("</td><td>");
    sendCalibrationSampleStatusPills(state, savedSource, "sample-status-pills");
    Esp32BaseWeb::sendChunk("</td><td><div class='row-actions sample-actions'>");
    MeteringParameters trialParams{};
    const bool trialParamsReady = meteringParamsForRecordTrend(trace.record, trialParams);
    const std::uint32_t trialVolumeMl = state.actualMl > 0 ? state.actualMl : trace.record.volumeMl;
    const std::uint32_t trialFlowMlPerMin =
        trace.record.durationSec > 0
            ? static_cast<std::uint32_t>((static_cast<std::uint64_t>(trialVolumeMl) * 60ULL +
                                          trace.record.durationSec / 2ULL) /
                                         trace.record.durationSec)
            : 0;
    const std::uint32_t trialDefaultTargetMl =
        trace.record.mode == WaterMode::Volume && trace.record.targetValue > 0 ? trace.record.targetValue : trialVolumeMl;
    if (trialParamsReady) {
        sendFmt("<button class='btn-link' type='button' data-sample-trial='1' data-sample-label='%s' data-startup-pulses='%lu' data-startup-volume='%lu' data-stable-ppl='%lu' data-flow-ml-min='%lu' data-target-ml='%lu' onclick='faucetOpenSampleTrial(this)'>试算目标水量</button>",
                savedSource ? "已保存样本" : "RAM 样本",
                static_cast<unsigned long>(trialParams.startupPulseCount),
                static_cast<unsigned long>(trialParams.startupVolumeMl),
                static_cast<unsigned long>(trialParams.stablePulsePerLiter),
                static_cast<unsigned long>(trialFlowMlPerMin),
                static_cast<unsigned long>(trialDefaultTargetMl));
    }
    if (!trace.truncated && waterRecordCanCalibrate(trace.record)) {
        sendFmt("<button class='btn-link' type='button' onclick=\"faucetShowSampleCalibration('%s')\">%s</button>",
                rowId,
                calibrated || state.actualMl > 0 ? "重新校准" : "校准容量");
    } else {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>不可入库</span>");
    }
    Esp32BaseWeb::sendChunk("</div></td></tr><tr id='");
    Esp32BaseWeb::sendChunk(rowId);
    Esp32BaseWeb::sendChunk("' class='sample-calibration-edit-row'><td colspan='10'>"
                            "<form class='sample-calibration-form' method='post' action='/faucet/calibration' onsubmit='return faucetSubmitSampleCalibration(this)'>"
                            "<input type='hidden' name='action' value='calibrate'>"
                            "<input type='hidden' name='ajax' value='1'>"
                            "<input type='hidden' name='traceSource' value='");
    Esp32BaseWeb::sendChunk(sourceValue);
    Esp32BaseWeb::sendChunk("'><input type='hidden' name='trace' value='");
    sendFmt("%lu", static_cast<unsigned long>(trace.traceId));
    Esp32BaseWeb::sendChunk("'><div class='sample-calibration-info'><strong>校准容量</strong>"
                            "<span>左侧样本来自本次脉冲明细，请按量杯读数填写右侧实测容量。</span>"
                            "<span>保存后写入设备样本库，作为生成计量方案的样本真值。</span>"
                            "<span>该操作只更新样本和校准记录，不会修改当前计量方案。</span>");
    if (calibrated) {
        char calibratedAt[40]{};
        formatWaterRecordTime(WaterRecord{calibration.calibratedAt,
                                          0,
                                          0,
                                          0,
                                          0,
                                          0,
                                          WaterMode::Volume,
                                          WaterResult::Completed,
                                          0,
                                          0,
                                          0.0f,
                                          {0, 0, 0, 0}},
                              calibratedAt,
                              sizeof(calibratedAt));
        const std::int32_t estimateDiff =
            static_cast<std::int32_t>(trace.record.volumeMl) - static_cast<std::int32_t>(calibration.actualMl);
        Esp32BaseWeb::sendChunk("<span>校准记录：第 ");
        sendFmt("%u 次 / %s / 实测脉冲/升 %luP/L / 估算差 ",
                static_cast<unsigned>(calibration.calibrationCount),
                calibratedAt[0] ? calibratedAt : "未知",
                static_cast<unsigned long>(measuredPulsePerLiter(trace.record, calibration)));
        sendSignedLiters(estimateDiff);
        Esp32BaseWeb::sendChunk("，当前计量方案未修改。</span>");
    }
    Esp32BaseWeb::sendChunk("</div><div class='sample-calibration-inputs'>"
                            "<label class='field sample-volume-field'><span>量杯实测容量</span>"
                            "<span class='sample-volume-input-row sample-volume-control'><input name='actualMl' type='number' min='");
    sendFmt("%lu", static_cast<unsigned long>(kMinVolumePresetMl));
    Esp32BaseWeb::sendChunk("' max='");
    sendFmt("%lu", static_cast<unsigned long>(kMaxVolumePresetMl));
    Esp32BaseWeb::sendChunk("' step='1' value='");
    sendFmt("%lu", static_cast<unsigned long>(defaultActualMl));
    Esp32BaseWeb::sendChunk("'><span class='unit-label'>ml</span></span></label>"
                            "<div class='form-actions'><input type='submit' value='保存校准容量'>"
                            "<button class='btn-link' type='button' onclick=\"faucetHideSampleCalibration('");
    Esp32BaseWeb::sendChunk(rowId);
    Esp32BaseWeb::sendChunk("')\">取消</button></div></div></form></td></tr>");
}

void sendCalibrationSamplesPanel(std::uint32_t samplePulseWindowSec) {
    Esp32BaseWeb::sendChunk("<section id='calibration-samples' class='panel'><div class='panel-head'><h3>样本</h3></div>"
                            "<p class='hint'>这里展示有脉冲明细的数据。RAM 临时样本重启会丢失；校准容量会先写入设备样本库，只有已入库、已校准容量、未截断、未发生暂停后恢复出水且稳态识别成功的样本才参与方案生成。</p>");
    WaterPulseTrace* savedTraces = nullptr;
    std::size_t savedCount = 0;
    if (ensureSavedPulseTracesReady()) {
        savedTraces = new (std::nothrow) WaterPulseTrace[kSavedPulseTraceMaxCountLimit]{};
        if (savedTraces) {
            savedCount = g_context.savedPulseTraces->list(savedTraces, kSavedPulseTraceMaxCountLimit);
        }
    }
    const std::size_t ramCount = g_context.pulseTraces ? g_context.pulseTraces->count() : 0;
    Esp32BaseWeb::sendChunk("<form class='sample-window-form' method='get' action='/faucet/calibration'>"
                            "<label class='field sample-window-field'><span>前几秒脉冲总数</span>");
    sendFmt("<input name='sampleSeconds' type='number' min='1' max='60' step='1' value='%u'></label>"
            "<input type='submit' value='应用'></form>",
            static_cast<unsigned>(samplePulseWindowSec));
    Esp32BaseWeb::sendChunk("<p class='hint'>用于观察启动阶段脉冲分布；范围 1-60 秒，默认 10 秒。</p>");
    if (savedCount == 0 && ramCount == 0) {
        delete[] savedTraces;
        Esp32BaseWeb::sendChunk("<p class='hint'>还没有脉冲明细样本。</p></section>");
        return;
    }
    sendFmt("<table class='calibration-sample-table'><tr><th>时间</th><th>目标</th><th>估算出水</th><th>实测容量</th><th>脉冲</th><th>前 %u 秒脉冲</th><th>稳态</th><th>来源</th><th>状态</th><th>操作</th></tr>",
            static_cast<unsigned>(samplePulseWindowSec));
    WaterRecord* listed = new (std::nothrow) WaterRecord[kSavedPulseTraceMaxCountLimit]{};
    std::size_t listedCount = 0;
    for (std::size_t i = 0; i < savedCount; ++i) {
        sendCalibrationSampleRow(savedTraces[i], true, samplePulseWindowSec);
        if (listed && listedCount < kSavedPulseTraceMaxCountLimit) {
            listed[listedCount++] = savedTraces[i].record;
        }
    }
    if (g_context.pulseTraces) {
        for (std::size_t offset = 0; offset < ramCount; ++offset) {
            const std::size_t index = ramCount - 1 - offset;
            const WaterPulseTrace* trace = g_context.pulseTraces->traceAt(index);
            if (!trace || !trace->finished || (listed && traceAlreadyListed(listed, listedCount, trace->record)) ||
                (!listed && savedCount > 0)) {
                continue;
            }
            sendCalibrationSampleRow(*trace, false, samplePulseWindowSec);
        }
    }
    Esp32BaseWeb::sendChunk("</table>"
                            "<div id='sample-trial-modal' class='sample-trial-modal' aria-hidden='true'>"
                            "<div class='sample-trial-card'><div class='panel-head'><h3>试算目标水量</h3>"
                            "<button class='btn-link' type='button' onclick='faucetCloseSampleTrial()'>关闭</button></div>"
                            "<form class='generated-estimator sample-trial-form' oninput='faucetEstimateSampleTrial(this)' onsubmit='return false'>"
                            "<p class='generated-note' data-sample-trial-label>-</p>"
                            "<label class='compact-field'><span>目标水量</span><span class='estimator-input-row'>"
                            "<input name='targetMl' type='number' min='1' max='");
    sendFmt("%lu", static_cast<unsigned long>(kMaxVolumePresetMl));
    Esp32BaseWeb::sendChunk("' step='1' value='1000'><span class='unit-label'>ml</span></span></label>"
                            "<div class='estimate-results'><div><span>预计出水时长</span><strong data-estimated-duration>-</strong></div>"
                            "<div><span>预计脉冲总数</span><strong data-estimated-pulses>-</strong></div></div>"
                            "<p class='generated-note'>按该样本对应的计量参数试算；仅用于核对，不会控制设备出水。</p>"
                            "</form></div></div></section>");
    delete[] listed;
    delete[] savedTraces;
}

void sendGeneratedSampleResiduals(const MeteringSchemeCandidate& candidate,
                                  const SegmentedCalibrationOptions& options) {
    if (!ensureSavedPulseTracesReady()) {
        return;
    }
    WaterPulseTrace* savedTraces = new (std::nothrow) WaterPulseTrace[kSavedPulseTraceMaxCountLimit]{};
    if (!savedTraces) {
        return;
    }
    const std::size_t savedCount = g_context.savedPulseTraces->list(savedTraces, kSavedPulseTraceMaxCountLimit);
    bool opened = false;
    for (std::size_t i = 0; i < savedCount; ++i) {
        const WaterPulseTrace& trace = savedTraces[i];
        const std::uint32_t actualMl = actualMlForSegmentedSample(trace);
        if (actualMl == 0 || trace.truncated || trace.sampleCount < 6 || trace.totalPulses == 0) {
            continue;
        }
        WaterPulseTraceSample* traceSamples = new (std::nothrow) WaterPulseTraceSample[trace.sampleCount]{};
        if (!traceSamples) {
            continue;
        }
        const bool copied = copySavedTraceSamples(trace, traceSamples, trace.sampleCount);
        const WaterPulseTraceAnalysis analysis =
            copied ? analyzeWaterPulseTrace(trace, traceSamples, trace.sampleCount, options) : WaterPulseTraceAnalysis{};
        delete[] traceSamples;
        if (!analysis.stable || analysis.stablePulseCount == 0 || candidate.params.stablePulsePerLiter == 0) {
            continue;
        }
        if (!opened) {
            Esp32BaseWeb::sendChunk("<table class='generated-residual-table'><tr><th>样本</th><th>启动</th><th>稳态脉冲</th><th>实测</th><th>拟合估算</th><th>误差</th><th>状态</th></tr>");
            opened = true;
        }
        char startTime[40]{};
        char actual[24]{};
        char estimated[24]{};
        char errorText[24]{};
        formatWaterRecordListTime(trace.record, startTime, sizeof(startTime));
        const std::uint64_t estimatedMl64 =
            static_cast<std::uint64_t>(candidate.params.startupVolumeMl) +
            (static_cast<std::uint64_t>(analysis.stablePulseCount) * 1000ULL +
             candidate.params.stablePulsePerLiter / 2ULL) /
                candidate.params.stablePulsePerLiter;
        const std::uint32_t estimatedMl =
            estimatedMl64 > UINT32_MAX ? UINT32_MAX : static_cast<std::uint32_t>(estimatedMl64);
        const std::int32_t diff = static_cast<std::int32_t>(estimatedMl) - static_cast<std::int32_t>(actualMl);
        const std::uint32_t absDiff = diff < 0 ? static_cast<std::uint32_t>(-diff) : static_cast<std::uint32_t>(diff);
        const std::uint32_t relTenths =
            actualMl == 0 ? 0 : static_cast<std::uint32_t>((static_cast<std::uint64_t>(absDiff) * 1000ULL + actualMl / 2ULL) / actualMl);
        formatLitersMl(actualMl, actual, sizeof(actual));
        formatLitersMl(estimatedMl, estimated, sizeof(estimated));
        std::snprintf(errorText,
                      sizeof(errorText),
                      "%c%lu.%03lu L / %lu.%lu%%",
                      diff < 0 ? '-' : '+',
                      static_cast<unsigned long>(absDiff / 1000UL),
                      static_cast<unsigned long>(absDiff % 1000UL),
                      static_cast<unsigned long>(relTenths / 10UL),
                      static_cast<unsigned long>(relTenths % 10UL));
        sendFmt("<tr><td>%s</td><td>%luP / 第%lus</td><td>%luP</td><td>%s</td><td>%s</td><td>%s</td><td>",
                startTime,
                static_cast<unsigned long>(analysis.startupPulseCount),
                static_cast<unsigned long>(analysis.stableStartSec),
                static_cast<unsigned long>(analysis.stablePulseCount),
                actual,
                estimated,
                errorText);
        Esp32BaseWeb::sendChunk((absDiff > options.maxErrorMl || relTenths > options.maxRelativeErrorTenthPercent)
                                    ? "<span class='status-pill status-warn'>误差偏大</span>"
                                    : "<span class='status-pill status-ok'>通过</span>");
        Esp32BaseWeb::sendChunk("</td></tr>");
    }
    if (opened) {
        Esp32BaseWeb::sendChunk("</table>");
    }
    delete[] savedTraces;
}

