tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendCalibrationGenerationPanel() {
    const SegmentedSampleDiagnostics diagnostics = collectSegmentedSampleDiagnostics(false);
    const SegmentedCalibrationOptions options = calibrationOptionsForWeb();
    const bool canGenerate = diagnostics.result.valid;
    const bool hasQualityWarnings =
        diagnostics.result.valid &&
        (diagnostics.result.qualityWarnings != kSegmentedCalibrationQualityNone ||
         diagnostics.result.sampleCount <= kSegmentedCalibrationRequiredSamples);
    MeteringSchemeCandidate candidate{};
    const bool showGeneratedResult = generationResultRequested();
    const bool candidateReady = showGeneratedResult && ensureMeteringSchemesReady() &&
                                g_context.meteringSchemes->loadCandidate(candidate) && candidate.ready;
    char sampleCountText[32]{};
    char sampleRange[48]{};
    char sampleNeed[48]{};
    char error[32]{};
    char relativeError[24]{};
    std::snprintf(sampleCountText,
                  sizeof(sampleCountText),
                  "%u/%u 条",
                  static_cast<unsigned>(diagnostics.validSampleCount),
                  static_cast<unsigned>(kSegmentedCalibrationRequiredSamples));
    if (diagnostics.result.valid) {
        char minActual[20]{};
        char maxActual[20]{};
        char maxError[20]{};
        formatLiters(diagnostics.result.minActualMl, minActual, sizeof(minActual));
        formatLiters(diagnostics.result.maxActualMl, maxActual, sizeof(maxActual));
        formatLiters(diagnostics.result.maxErrorMl, maxError, sizeof(maxError));
        std::snprintf(sampleRange, sizeof(sampleRange), "%s - %s", minActual, maxActual);
        std::snprintf(error, sizeof(error), "%s", maxError);
        std::snprintf(relativeError,
                      sizeof(relativeError),
                      "%u.%u%%",
                      static_cast<unsigned>(diagnostics.result.maxRelativeErrorTenthPercent / 10U),
                      static_cast<unsigned>(diagnostics.result.maxRelativeErrorTenthPercent % 10U));
        std::snprintf(sampleNeed, sizeof(sampleNeed), "0条");
    } else {
        std::snprintf(sampleRange, sizeof(sampleRange), "-");
        std::snprintf(error, sizeof(error), "-");
        std::snprintf(relativeError, sizeof(relativeError), "-");
        if (diagnostics.validSampleCount < kSegmentedCalibrationRequiredSamples) {
            std::snprintf(sampleNeed,
                          sizeof(sampleNeed),
                          "%u条可生成样本",
                          static_cast<unsigned>(kSegmentedCalibrationRequiredSamples - diagnostics.validSampleCount));
        } else {
            std::snprintf(sampleNeed, sizeof(sampleNeed), "%s", segmentedRejectReasonText(diagnostics.result.rejectReason));
        }
    }
    Esp32BaseWeb::sendChunk("<section id='scheme-generation' class='panel'><h3>生成计量参数</h3>"
                            "<p class='hint'>手动执行：只扫描满足有效样本条件的数据，生成参数后显示待保存结果；保存为新方案前不会改变当前出水估算。</p>");
    Esp32BaseWeb::sendChunk("<div class='calibration-generation-settings'>");
    sendFmt("<span>分析脉冲间隔 <b>%s</b></span>",
            options.pulseMinIntervalUsOverride == 0 ? "记录值" : "覆盖值");
    if (options.pulseMinIntervalUsOverride != 0) {
        sendFmt("<span><b>%luus</b></span>", static_cast<unsigned long>(options.pulseMinIntervalUsOverride));
    }
    sendFmt("<span>稳态窗口 <b>%lus</b></span><span>稳态容差 <b>%u%%</b></span>"
            "<span>容量跨度提醒 <b>%luml</b></span><span>误差提醒阈值 <b>%luml / %u.%u%%</b></span></div>",
            static_cast<unsigned long>(options.stableWindowSec),
            static_cast<unsigned>(options.stableTolerancePercent),
            static_cast<unsigned long>(options.minVolumeSpanMl),
            static_cast<unsigned long>(options.maxErrorMl),
            static_cast<unsigned>(options.maxRelativeErrorTenthPercent / 10U),
            static_cast<unsigned>(options.maxRelativeErrorTenthPercent % 10U));
    Esp32BaseWeb::sendChunk("<section class='sample-coverage-diagnostic sample-coverage-compact'>"
                            "<div class='diagnostic-head'><h3>样本覆盖</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div><div class='coverage-metric-row'>",
            canGenerate ? (hasQualityWarnings ? "status-warn" : "status-ok") : "status-muted",
            canGenerate ? (hasQualityWarnings ? "可生成，需复核" : "可生成") : "样本不足");
    sendFmt("<div class='diagnostic-metric'><span>可生成样本</span><strong>%s</strong></div>", sampleCountText);
    sendFmt("<div class='diagnostic-metric'><span>容量范围</span><strong>%s</strong></div>", sampleRange);
    sendFmt("<div class='diagnostic-metric'><span>拟合误差</span><strong>%s / %s</strong></div>",
            error,
            relativeError);
    sendFmt("<div class='diagnostic-metric'><span>还需</span><strong>%s</strong></div>", sampleNeed);
    Esp32BaseWeb::sendChunk("</div><div class='coverage-foot'>");
    sendFmt("<span>已保存明细 <b>%u条</b></span><span>已测容量 <b>%u条</b></span>",
            static_cast<unsigned>(diagnostics.savedTraceCount),
            static_cast<unsigned>(diagnostics.measuredSampleCount));
    sendFmt("<span>还需 <b>%s</b></span>", sampleNeed);
    Esp32BaseWeb::sendChunk("</div></section>");
    if (!canGenerate && diagnostics.validSampleCount >= kSegmentedCalibrationRequiredSamples) {
        sendFmt("<p class='warn'>生成结果未保存：%s。请重校准异常样本、扩大容量覆盖，或谨慎调整计量生成高级参数后重新生成。</p>",
                segmentedRejectReasonText(diagnostics.result.rejectReason));
    }
    if (canGenerate && hasQualityWarnings) {
        bool firstWarning = true;
        Esp32BaseWeb::sendChunk("<p class='warn'>样本质量提醒：");
        if (diagnostics.result.sampleCount <= kSegmentedCalibrationRequiredSamples) {
            Esp32BaseWeb::sendChunk("样本偏少，建议补充不同容量样本");
            firstWarning = false;
        }
        if ((diagnostics.result.qualityWarnings & kSegmentedCalibrationQualityVolumeSpanSmall) != 0) {
            Esp32BaseWeb::sendChunk(firstWarning ? "容量跨度不足" : "；容量跨度不足");
            firstWarning = false;
        }
        if ((diagnostics.result.qualityWarnings & kSegmentedCalibrationQualityErrorHigh) != 0) {
            Esp32BaseWeb::sendChunk(firstWarning ? "拟合误差偏大" : "；拟合误差偏大");
            firstWarning = false;
        }
        Esp32BaseWeb::sendChunk("。已生成参数，但保存或启用前建议复核样本。</p>");
    }
    if (candidateReady) {
        char generatedStartupVolume[24]{};
        char generatedMinActual[20]{};
        char generatedMaxActual[20]{};
        char generatedRange[48]{};
        char generatedError[20]{};
        formatLiters(candidate.params.startupVolumeMl, generatedStartupVolume, sizeof(generatedStartupVolume));
        formatLiters(candidate.minActualMl, generatedMinActual, sizeof(generatedMinActual));
        formatLiters(candidate.maxActualMl, generatedMaxActual, sizeof(generatedMaxActual));
        formatLiters(candidate.maxErrorMl, generatedError, sizeof(generatedError));
        std::snprintf(generatedRange, sizeof(generatedRange), "%s - %s", generatedMinActual, generatedMaxActual);
        const std::uint32_t averageFlowMlPerMin =
            diagnostics.validDurationSecTotal > 0
                ? static_cast<std::uint32_t>((static_cast<std::uint64_t>(diagnostics.validActualMlTotal) * 60ULL +
                                              diagnostics.validDurationSecTotal / 2ULL) /
                                             diagnostics.validDurationSecTotal)
                : 0;
        const std::uint32_t estimatorDefaultMl =
            candidate.maxActualMl > 0 ? candidate.maxActualMl : std::max<std::uint32_t>(1000, candidate.params.startupVolumeMl);
        sendFmt("<section class='generated-scheme-result' data-startup-pulses='%lu' data-startup-volume='%lu' data-stable-ppl='%lu' data-startup-sec='%lu' data-flow-ml-min='%lu'>",
                static_cast<unsigned long>(candidate.params.startupPulseCount),
                static_cast<unsigned long>(candidate.params.startupVolumeMl),
                static_cast<unsigned long>(candidate.params.stablePulsePerLiter),
                static_cast<unsigned long>(candidate.startupDurationAvgSec),
                static_cast<unsigned long>(averageFlowMlPerMin));
        Esp32BaseWeb::sendChunk("<div class='panel-head'><h3>生成结果</h3>"
                                "<span class='status-pill status-warn'>已生成，待保存</span></div>"
                                "<div class='generated-scheme-layout'><div class='generated-result-main'>"
                                "<table class='generated-scheme-table'><tr><th>启动脉冲数</th><th>启动水量</th><th>稳态P/L</th><th>样本</th><th>容量范围</th><th>最大误差</th></tr>");
        sendFmt("<tr><td>%luP</td><td>%s</td><td>%luP/L</td><td>%u 条</td><td>%s</td><td>%s / %.1f%%</td></tr></table>"
                "<p class='generated-note'>",
                static_cast<unsigned long>(candidate.params.startupPulseCount),
                generatedStartupVolume,
                static_cast<unsigned long>(candidate.params.stablePulsePerLiter),
                static_cast<unsigned>(candidate.sampleCount),
                generatedRange,
                generatedError,
                static_cast<double>(candidate.maxErrorPercent));
        sendHtmlEscapedBounded(candidate.creationSummary, sizeof(candidate.creationSummary));
        sendFmt(" 启动阶段平均 %lus。</p>",
                static_cast<unsigned long>(candidate.startupDurationAvgSec));
        sendGeneratedSampleResiduals(candidate, options);
        Esp32BaseWeb::sendChunk("<div class='form-actions generated-result-actions'><form class='inline-form' method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                                "<input type='hidden' name='action' value='save_generated_scheme'>"
                                "<label class='compact-field generated-name-field'><span>新方案名称</span><input name='name' maxlength='31' value='样本生成方案'></label>"
                                "<input class='primary' type='submit' value='保存为新方案'></form>"
                                "<form method='post' action='/faucet/calibration' onsubmit='return faucetSubmitGenerationAction(this)'>"
                                "<input type='hidden' name='action' value='discard_generated_scheme'>"
                                "<input type='hidden' name='ajax' value='1'>"
                                "<input class='secondary' type='submit' value='放弃生成结果'></form></div></div>"
                                "<form class='generated-estimator' oninput='faucetEstimateGeneratedScheme(this)' onsubmit='return false'>"
                                "<label class='compact-field'><span>试算目标水量</span><span class='estimator-input-row'><input name='targetMl' type='number' min='1' max='");
        sendFmt("%lu' step='1' value='%lu'><span class='unit-label'>ml</span></span></label>",
                static_cast<unsigned long>(kMaxVolumePresetMl),
                static_cast<unsigned long>(estimatorDefaultMl));
        Esp32BaseWeb::sendChunk("<div class='estimate-results'><div><span>预计出水时长</span><strong data-estimated-duration>-</strong></div>"
                                "<div><span>预计脉冲总数</span><strong data-estimated-pulses>-</strong></div></div>"
                                "<p class='generated-note'>脉冲按生成参数计算；时长按当前有效样本平均流速估算，仅用于核对。</p>"
                                "</form></div></section>");
    }
    Esp32BaseWeb::sendChunk("<div class='form-actions'>"
                            "<form method='post' action='/faucet/calibration' onsubmit='return faucetSubmitGenerationAction(this)'>"
                            "<input type='hidden' name='action' value='generate_segmented'>"
                            "<input type='hidden' name='ajax' value='1'>");
    sendFmt("<input type='submit' value='%s'></form>", candidateReady ? "重新生成" : "生成参数");
    Esp32BaseWeb::sendChunk("</div></section>");
}

