tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendMachineStatusNoteOnlyItem(const char* noteId, const char* label, const char* note) {
    sendFmt("<span class='machine-status-item machine-status-note-only'><span>%s</span><small id='%s' class='machine-status-note'>%s</small></span>",
            label,
            noteId,
            note);
}

void formatPresetTarget(const PresetConfig& preset, char* out, std::size_t len) {
    if (preset.type == PresetType::Time) {
        formatSecondsValue(preset.value, out, len);
        return;
    }
    formatLiters(preset.value, out, len);
}

std::size_t enabledPresetCount(const SystemConfig& config) {
    std::size_t count = 0;
    for (std::size_t i = 0; i < kPresetCount; ++i) {
        if (config.presets[i].enabled) {
            ++count;
        }
    }
    return count;
}

std::size_t enabledPresetOrdinal(const SystemConfig& config, std::size_t index) {
    if (index >= kPresetCount || !config.presets[index].enabled) {
        return 0;
    }
    std::size_t ordinal = 0;
    for (std::size_t i = 0; i <= index && i < kPresetCount; ++i) {
        if (config.presets[i].enabled) {
            ++ordinal;
        }
    }
    return ordinal;
}

void formatPresetEstimate(const PresetConfig& preset,
                          const MeteringParameters& params,
                          std::uint32_t durationSec,
                          std::uint32_t timeVolumeMl,
                          std::uint32_t timePulseCount,
                          float stablePulsePerSec,
                          const char* reason,
                          char* out,
                          std::size_t len) {
    if (preset.type == PresetType::Time) {
        if (timeVolumeMl > 0 && timePulseCount > 0 && stablePulsePerSec > 0.0f) {
            char volume[24]{};
            formatLiters(timeVolumeMl, volume, sizeof(volume));
            std::snprintf(out,
                          len,
                          "稳态估算 %s · %luP · %luP/L",
                          volume,
                          static_cast<unsigned long>(timePulseCount),
                          static_cast<unsigned long>(params.stablePulsePerLiter));
        } else {
            std::snprintf(out, len, "%s", reason ? reason : "缺少近期流速");
        }
        return;
    }
    const MeteringTargetEstimate estimate = meteringEstimateForTarget(params, preset.value);
    if (!estimate.valid) {
        std::snprintf(out, len, "%s", reason ? reason : "计量参数未就绪");
        return;
    }
    char duration[24]{};
    if (durationSec > 0) {
        formatSecondsValue(durationSec, duration, sizeof(duration));
        std::snprintf(out,
                      len,
                      "预计 %luP/L · %luP · 约 %s",
                      static_cast<unsigned long>(estimate.fullRunPulsePerLiter),
                      static_cast<unsigned long>(estimate.pulseCount),
                      duration);
    } else {
        std::snprintf(out,
                      len,
                      "预计 %luP/L · %luP",
                      static_cast<unsigned long>(estimate.fullRunPulsePerLiter),
                      static_cast<unsigned long>(estimate.pulseCount));
    }
}

std::uint32_t recordFlowMlPerMin(std::uint32_t volumeMl, std::uint32_t durationSec) {
    if (volumeMl == 0 || durationSec == 0) {
        return 0;
    }
    return static_cast<std::uint32_t>((static_cast<std::uint64_t>(volumeMl) * 60ULL + durationSec / 2ULL) /
                                      durationSec);
}

std::uint32_t bucketFlowMlPerMin(std::uint32_t pulseDelta,
                                 std::uint32_t durationSec,
                                 const MeteringParameters& params) {
    if (pulseDelta == 0 || durationSec == 0 || params.stablePulsePerLiter == 0) {
        return 0;
    }
    return static_cast<std::uint32_t>(
        (static_cast<std::uint64_t>(pulseDelta) * 60000ULL + (durationSec * params.stablePulsePerLiter) / 2ULL) /
        (static_cast<std::uint64_t>(durationSec) * params.stablePulsePerLiter));
}

std::uint32_t stableFlowMlPerMin(float stablePulsePerSec, const MeteringParameters& params) {
    if (stablePulsePerSec <= 0.0f || params.stablePulsePerLiter == 0) {
        return 0;
    }
    const double mlPerMin =
        static_cast<double>(stablePulsePerSec) * 60000.0 / static_cast<double>(params.stablePulsePerLiter);
    return mlPerMin <= 0.0 ? 0 : static_cast<std::uint32_t>(mlPerMin + 0.5);
}

void formatFlowLitersPerMin(std::uint32_t flowMlPerMin, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    const std::uint32_t centiLitersPerMin = (flowMlPerMin + 5U) / 10U;
    if (centiLitersPerMin == 0) {
        std::snprintf(out, len, "-");
        return;
    }
    std::snprintf(out,
                  len,
                  "%lu.%02lu L/min",
                  static_cast<unsigned long>(centiLitersPerMin / 100U),
                  static_cast<unsigned long>(centiLitersPerMin % 100U));
}

void formatFlowNumber(std::uint32_t flowMlPerMin, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    const std::uint32_t centiLitersPerMin = (flowMlPerMin + 5U) / 10U;
    if (centiLitersPerMin == 0) {
        std::snprintf(out, len, "-");
        return;
    }
    std::snprintf(out,
                  len,
                  "%lu.%02lu",
                  static_cast<unsigned long>(centiLitersPerMin / 100U),
                  static_cast<unsigned long>(centiLitersPerMin % 100U));
}

void formatFlowMeta(std::uint32_t recentAverageFlowMlPerMin, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    char average[16]{};
    formatFlowNumber(recentAverageFlowMlPerMin, average, sizeof(average));
    std::snprintf(out, len, "L/min · 近期平均 %s", average);
}

void sendNextPresetControl(const AppSnapshot& snapshot) {
    const SystemConfig& config = *g_context.config;
    const bool available = snapshot.water.selectedPreset < kPresetCount && config.presets[snapshot.water.selectedPreset].enabled;
    char target[24]{};
    char estimate[160]{};
    const std::size_t count = enabledPresetCount(config);
    const std::size_t ordinal = enabledPresetOrdinal(config, snapshot.water.selectedPreset);
    Esp32BaseWeb::sendChunk("<div id='nextPresetControl' class='next-preset-control'>"
                            "<div class='next-preset-copy'><span>下次预设</span><strong id='nextPresetLabel'>");
    if (available) {
        const PresetConfig& preset = config.presets[snapshot.water.selectedPreset];
        formatPresetTarget(preset, target, sizeof(target));
        sendFmt("P%u/%u · ", static_cast<unsigned>(ordinal), static_cast<unsigned>(count));
        sendHtmlEscapedBounded(preset.name[0] ? preset.name : "未命名", sizeof(preset.name));
        sendFmt(" · %s", target);
        formatPresetEstimate(preset,
                             snapshot.meteringParams,
                             snapshot.selectedPresetEstimatedDurationSec,
                             snapshot.selectedPresetEstimatedVolumeMl,
                             snapshot.selectedPresetEstimatedPulseCount,
                             snapshot.selectedPresetStablePulsePerSec,
                             snapshot.selectedPresetEstimateReason,
                             estimate,
                             sizeof(estimate));
    } else {
        Esp32BaseWeb::sendChunk("无可用预设");
        std::snprintf(estimate, sizeof(estimate), "请先在预设页启用至少一项");
    }
    sendFmt("</strong><small id='nextPresetEstimate'%s>%s</small></div></div>",
            estimate[0] ? "" : " style='display:none'",
            estimate);
}

const char* machineStatusNote(const AppSnapshot& snapshot) {
    switch (snapshot.water.state) {
        case WaterState::Idle:
            return "设备可用，等待按键启动";
        case WaterState::Confirm:
            return "等待确认，确认后开始出水";
        case WaterState::Running:
            return "正在出水，请留意容器";
        case WaterState::Paused:
            return "已暂停，等待继续或取消";
        case WaterState::Error:
            return resultText(snapshot.water.lastResult);
    }
    return "状态未知";
}

void sendMachineStatusCard(const AppSnapshot& snapshot, bool screenOn) {
    const bool shouldShowProgress = snapshot.water.state == WaterState::Running ||
                                    snapshot.water.state == WaterState::Paused ||
                                    snapshot.water.state == WaterState::Confirm;
    char targetValue[24]{};
    if (snapshot.water.mode == WaterMode::Time) {
        formatSecondsValue(snapshot.water.targetValue, targetValue, sizeof(targetValue));
    } else {
        formatLiters(snapshot.water.targetValue, targetValue, sizeof(targetValue));
    }
    char outValue[24]{};
    formatLiters(snapshot.water.volumeMl, outValue, sizeof(outValue));
    const std::uint32_t progressBase = snapshot.water.mode == WaterMode::Time ? snapshot.water.elapsedSec : snapshot.water.volumeMl;
    const std::uint32_t progressPercent = percentOf(progressBase, snapshot.water.targetValue);
    char progressText[48]{};
    if (snapshot.water.mode == WaterMode::Time) {
        char elapsed[20]{};
        formatSecondsValue(snapshot.water.elapsedSec, elapsed, sizeof(elapsed));
        std::snprintf(progressText, sizeof(progressText), "%s / %s", elapsed, targetValue);
    } else {
        std::snprintf(progressText, sizeof(progressText), "%s / %s", outValue, targetValue);
    }
    const std::uint32_t remaining =
        snapshot.water.mode == WaterMode::Time
            ? (snapshot.water.targetValue > snapshot.water.elapsedSec ? snapshot.water.targetValue - snapshot.water.elapsedSec : 0)
            : (snapshot.water.targetValue > snapshot.water.volumeMl ? snapshot.water.targetValue - snapshot.water.volumeMl : 0);
    char remainingValue[24]{};
    if (snapshot.water.mode == WaterMode::Time) {
        formatSecondsValue(remaining, remainingValue, sizeof(remainingValue));
    } else {
        formatLiters(remaining, remainingValue, sizeof(remainingValue));
    }
    char elapsedText[24]{};
    formatSecondsValue(snapshot.water.elapsedSec, elapsedText, sizeof(elapsedText));
    char targetMeta[96]{};
    if (snapshot.water.mode == WaterMode::Volume) {
        const MeteringTargetEstimate targetEstimate =
            meteringEstimateForTarget(snapshot.meteringParams, snapshot.water.targetValue);
        char durationText[24]{};
        if (!targetEstimate.valid) {
            std::snprintf(targetMeta,
                          sizeof(targetMeta),
                          "%s",
                          snapshot.targetEstimateReason ? snapshot.targetEstimateReason : "计量参数未就绪");
        } else if (snapshot.targetEstimatedDurationSec > 0) {
            formatSecondsValue(snapshot.targetEstimatedDurationSec, durationText, sizeof(durationText));
            std::snprintf(targetMeta,
                          sizeof(targetMeta),
                          "预计约 %s",
                          durationText);
        } else {
            std::snprintf(targetMeta, sizeof(targetMeta), "缺少近期平均流速");
        }
    } else if (snapshot.targetEstimatedVolumeMl > 0 && snapshot.targetEstimatedPulseCount > 0 &&
               snapshot.targetStablePulsePerSec > 0.0f) {
        targetMeta[0] = '\0';
    } else {
        targetMeta[0] = '\0';
    }
    char outputMeta[32]{};
    std::snprintf(outputMeta, sizeof(outputMeta), "已运行 %s", elapsedText);
    char remainingMeta[24]{};
    std::snprintf(remainingMeta, sizeof(remainingMeta), "完成 %lu%%", static_cast<unsigned long>(progressPercent));
    char currentFlow[24]{};
    formatFlowNumber(snapshot.currentFlowMlPerMin, currentFlow, sizeof(currentFlow));
    char currentFlowMeta[40]{};
    formatFlowMeta(snapshot.recentAverageFlowMlPerMin, currentFlowMeta, sizeof(currentFlowMeta));
    char meteringParams[64]{};
    if (validMeteringSchemeParameters(snapshot.meteringParams)) {
        std::snprintf(meteringParams,
                      sizeof(meteringParams),
                      "启动 %luP · %luml / 稳态 %luP/L",
                      static_cast<unsigned long>(snapshot.meteringParams.startupPulseCount),
                      static_cast<unsigned long>(snapshot.meteringParams.startupVolumeMl),
                      static_cast<unsigned long>(snapshot.meteringParams.stablePulsePerLiter));
    } else {
        std::snprintf(meteringParams, sizeof(meteringParams), "未校准");
    }
    char droppedPulses[24]{};
    std::snprintf(droppedPulses, sizeof(droppedPulses), "%lu", static_cast<unsigned long>(snapshot.flowDroppedPulses));
    char valvePwmDuty[12]{};
    std::snprintf(valvePwmDuty, sizeof(valvePwmDuty), "%u%%", static_cast<unsigned>(snapshot.valve.dutyPercent));
    char valvePwmNote[32]{};
    std::snprintf(valvePwmNote,
                  sizeof(valvePwmNote),
                  "%lus全功率→%u%%保持",
                  static_cast<unsigned long>(g_context.config->valveFullPowerSec),
                  static_cast<unsigned>(g_context.config->valveHoldDutyPercent));

    const bool showResult = snapshot.water.state == WaterState::Error || snapshot.localMode == LocalUiMode::Result;
    const bool showRunningNote = snapshot.water.state == WaterState::Running;
    const char* machineLayoutClass = shouldShowProgress ? "machine-main" : "machine-main compact";
    sendFmt("<h2>机器状态</h2><section class='panel machine-status'><div class='%s'><div class='machine-hero'>"
            "<div class='machine-hero-head'><strong>",
            machineLayoutClass);
    Esp32BaseWeb::sendChunk("<span id='machineState'>");
    Esp32BaseWeb::sendChunk(stateText(snapshot.water.state));
    sendFmt("</span></strong><div class='machine-context'><p id='machineStatusNote' class='machine-alert'%s>%s</p>",
            showRunningNote ? "" : " style='display:none'",
            machineStatusNote(snapshot));
    sendNextPresetControl(snapshot);
    Esp32BaseWeb::sendChunk("</div></div>");
    sendFmt("<div id='machineProgress' class='machine-progress'%s><div class='machine-progress-head'><span>出水进度</span><strong id='machineProgressText'>%s</strong></div>"
            "<div class='progress'><span id='machineProgressBar' style='width:%lu%%'></span></div></div>",
            shouldShowProgress ? "" : " style='display:none'",
            progressText,
            static_cast<unsigned long>(progressPercent));
    Esp32BaseWeb::sendChunk("</div><div class='machine-overview'><div class='machine-task-grid'>");
    sendMachineTaskCard("targetValue", "targetMeta", "目标", targetValue, targetMeta);
    sendMachineTaskCard("outputValue", "outputMeta", "已出水", outValue, outputMeta);
    sendMachineTaskCard("remainingValue", "remainingMeta", "剩余", remainingValue, remainingMeta);
    sendMachineTaskCard("currentFlowCard", "currentFlowValue", "currentFlowMeta", "流速", currentFlow, currentFlowMeta, false);
    Esp32BaseWeb::sendChunk("</div><div class='machine-status-strip'>");
    sendMachineStatusItem("valveStatus", "阀门", snapshot.water.valveOpen ? "开" : "关");
    sendMachineStatusItemNote("valvePwmDuty", "valvePwmNote", "PWM", valvePwmDuty, valvePwmNote);
    sendMachineStatusNoteOnlyItem("meteringParams", "计量参数", meteringParams);
    sendMachineStatusItem("screenStatus", "屏幕", screenOn ? "亮屏" : "休眠");
    sendMachineStatusItem("resultStatus", "结果", resultText(snapshot.water.lastResult), "resultItem", !showResult);
    sendMachineStatusItem("droppedPulses", "丢弃脉冲", droppedPulses, "droppedPulsesItem", snapshot.flowDroppedPulses == 0);
    Esp32BaseWeb::sendChunk("</div></div></div></section>");
}

TodayOverview collectTodayOverview(std::uint32_t now, std::uint32_t fallbackTodayMl) {
    TodayOverview overview{};
    overview.volumeMl = fallbackTodayMl;
    if (!g_context.records || !g_context.records->ready() || now < kMinRealDateSeconds || waterTaskActive()) {
        return overview;
    }
    overview.timeReady = true;
    const std::uint32_t todayStart = (now / 86400UL) * 86400UL;
    WaterRecord records[kDefaultRecordPageSize]{};
    const std::size_t total = g_context.records->count();
    bool stopAfterPage = false;
    for (std::size_t offset = 0; offset < total && !stopAfterPage; offset += kDefaultRecordPageSize) {
        const std::size_t page = offset / kDefaultRecordPageSize;
        const std::size_t read = g_context.records->readPage(page, kDefaultRecordPageSize, records, kDefaultRecordPageSize);
        if (read == 0) {
            break;
        }
        for (std::size_t i = 0; i < read; ++i) {
            if (!waterRecordHasRealTime(records[i])) {
                continue;
            }
            if (records[i].startTime > now) {
                continue;
            }
            if (records[i].startTime < todayStart) {
                stopAfterPage = true;
                break;
            }
            ++overview.count;
            overview.durationSec += records[i].durationSec;
            if (overview.latestCount < kHomeTodayRecordLimit) {
                overview.latest[overview.latestCount++] = records[i];
            }
        }
    }
    return overview;
}

