tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    const std::uint32_t samplePulseWindowSec = selectedSamplePulseWindowSec();
    char text[32]{};
    if (getParam("partial", text, sizeof(text))) {
        if (!Esp32BaseWeb::beginResponse(200, "text/html; charset=utf-8", nullptr)) {
            return;
        }
        if (std::strcmp(text, "generation") == 0) {
            sendCalibrationGenerationPanel();
        } else if (std::strcmp(text, "samples") == 0) {
            sendCalibrationSamplesPanel(samplePulseWindowSec);
        }
        Esp32BaseWeb::endResponse();
        return;
    }
    if (getParam("scheme", text, sizeof(text))) {
        if (std::strcmp(text, "new") == 0) {
            sendMeteringSchemeEditPage(true, nullptr);
            return;
        }
        std::uint32_t id = 0;
        MeteringSchemeRecord scheme{};
        if (!parseU32(text, id) || !ensureMeteringSchemesReady() || !g_context.meteringSchemes->findById(id, scheme)) {
            Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=invalid_value");
            return;
        }
        sendMeteringSchemeEditPage(false, &scheme);
        return;
    }

    Esp32BaseWeb::sendHeader("校准工作台");
    Esp32BaseWeb::sendChunk("<h2>校准工作台</h2>");
    sendNoticeFromQuery();
    Esp32BaseWeb::sendChunk("<div class='records-top-grid records-diagnostic-strip'>");
    sendSegmentedMeteringPanel();
    sendPulseTraceCachePanel();
    Esp32BaseWeb::sendChunk("</div>");

    sendCalibrationGenerationPanel();
    sendCalibrationSamplesPanel(samplePulseWindowSec);
    Esp32BaseWeb::sendChunk("<div class='calibration-param-layout'>");
    sendCalibrationParameterPanels();
    Esp32BaseWeb::sendChunk("</div>");
    sendCalibrationFormulaPanel();
    sendCalibrationPageScript();
    sendPageEnd();
}

void handleRecordDetailPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    if (Esp32BaseWeb::hasParam("info")) {
        handleRecordInfoPage();
        return;
    }
    char text[24]{};
    const bool fromCalibration = calibrationContextRequested();
    const char* backHref = fromCalibration ? "/faucet/calibration" : "/faucet/records";
    const char* backLabel = fromCalibration ? "返回校准" : "返回记录";
    const char* detailPath = fromCalibration ? "/faucet/calibration/detail" : "/faucet/records/detail";
    const char* contextParam = fromCalibration ? "from=calibration&" : "";
    bool rawRequest = false;
    if (getParam("raw", text, sizeof(text))) {
        std::uint32_t rawValue = 0;
        rawRequest = parseU32(text, rawValue) && rawValue != 0;
    }
    bool rawTraceShowAll = false;
    if (getParam("all", text, sizeof(text))) {
        std::uint32_t allValue = 0;
        rawTraceShowAll = parseU32(text, allValue) && allValue != 0;
    }
    if (!contextReady()) {
        if (rawRequest) {
            sendPlainTextResponse(503, "上下文未就绪。\n");
        } else {
            Esp32BaseWeb::sendHeader("脉冲明细");
            Esp32BaseWeb::sendChunk("<h2>脉冲明细</h2><p class='err'>上下文未就绪。</p>");
            sendPageEnd();
        }
        return;
    }
    if (waterTaskActive()) {
        sendBusyJson("record_detail");
        return;
    }
    if (!g_context.pulseTraces && !g_context.savedPulseTraces) {
        if (rawRequest) {
            sendPlainTextResponse(503, "脉冲明细缓存不可用。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>脉冲明细缓存不可用。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }
    std::uint32_t traceId = 0;
    if (!getParam("trace", text, sizeof(text)) || !parseU32(text, traceId)) {
        if (rawRequest) {
            sendPlainTextResponse(400, "明细编号无效。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>明细编号无效。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }
    std::uint32_t bucketSeconds = 1;
    if (getParam("bucket", text, sizeof(text))) {
        parseU32(text, bucketSeconds);
    }
    if (bucketSeconds != 2 && bucketSeconds != 3 && bucketSeconds != 4 && bucketSeconds != 5) {
        bucketSeconds = 1;
    }
    bool savedSource = false;
    if (getParam("saved", text, sizeof(text))) {
        std::uint32_t savedValue = 0;
        savedSource = parseU32(text, savedValue) && savedValue != 0;
    }
    WaterPulseTrace savedTrace{};
    const WaterPulseTrace* trace = nullptr;
    if (savedSource) {
        if (ensureSavedPulseTracesReady() && g_context.savedPulseTraces->findById(traceId, savedTrace)) {
            trace = &savedTrace;
        }
    } else if (g_context.pulseTraces) {
        trace = g_context.pulseTraces->findById(traceId);
    }
    if (!trace) {
        if (rawRequest) {
            sendPlainTextResponse(404, "该脉冲明细不存在或已被 RAM 缓存淘汰。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>该脉冲明细不存在或已被 RAM 缓存淘汰。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }

    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace->sampleCount]{};
    if (!samples) {
        delete[] samples;
        if (rawRequest) {
            sendPlainTextResponse(500, "内存不足，无法生成脉冲明细。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    if (savedSource) {
        if (!g_context.savedPulseTraces ||
            g_context.savedPulseTraces->readSamples(trace->traceId, samples, trace->sampleCount) != trace->sampleCount) {
            delete[] samples;
            if (rawRequest) {
                sendPlainTextResponse(500, "已保存明细读取失败。\n");
                return;
            }
            Esp32BaseWeb::sendHeader("脉冲明细");
            Esp32BaseWeb::sendChunk("<p class='err'>已保存明细读取失败。</p>");
            sendPageEnd();
            return;
        }
    } else {
        for (std::size_t i = 0; i < trace->sampleCount; ++i) {
            const WaterPulseTraceSample* sample = g_context.pulseTraces ? g_context.pulseTraces->sampleAt(*trace, i) : nullptr;
            samples[i] = sample ? *sample : WaterPulseTraceSample{};
        }
    }
    if (rawRequest) {
        sendPulseTraceRawText(*trace, samples, rawTraceShowAll);
        delete[] samples;
        return;
    }
    WaterPulseTraceBucket* buckets = new (std::nothrow) WaterPulseTraceBucket[trace->sampleCount]{};
    if (!buckets) {
        delete[] samples;
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    const std::size_t bucketCount =
        aggregateWaterPulseTrace(*trace, samples, trace->sampleCount, bucketSeconds, buckets, trace->sampleCount);
    const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(*trace, samples, trace->sampleCount);
    std::uint32_t maxDelta = 1;
    std::uint32_t maxRawDelta = 1;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        maxDelta = std::max(maxDelta, buckets[i].pulseDelta);
        maxRawDelta = std::max(maxRawDelta, buckets[i].rawEdgeDelta);
    }
    const std::uint32_t rawEdgeCount = static_cast<std::uint32_t>(trace->sampleCount);
    const std::uint32_t effectivePulseCountValue = effectivePulseCount(*trace, samples, trace->sampleCount);
    const std::uint32_t filteredEdgeCount =
        rawEdgeCount >= effectivePulseCountValue ? rawEdgeCount - effectivePulseCountValue : 0;
    const std::uint32_t effectiveRateTenths =
        rawEdgeCount == 0 ? 0 : static_cast<std::uint32_t>((effectivePulseCountValue * 1000ULL + rawEdgeCount / 2U) / rawEdgeCount);
    std::uint32_t pauseTotalUs = 0;
    for (std::uint8_t i = 0; i < trace->pauseWindowCount; ++i) {
        const WaterPulseTracePauseWindow& window = trace->pauseWindows[i];
        if (window.endElapsedUs > window.startElapsedUs) {
            pauseTotalUs += window.endElapsedUs - window.startElapsedUs;
        }
    }
    MeteringParameters trendMeteringParams{};
    const bool trendVolumeReady = meteringParamsForRecordTrend(trace->record, trendMeteringParams);
    const std::uint32_t estimatedFinalVolumeMl =
        trendVolumeReady ? estimateVolumeMlFromPulses(effectivePulseCountValue, trendMeteringParams) : 0;
    const std::uint32_t maxVolumeMl =
        trendVolumeReady ? std::max<std::uint32_t>(1, std::max(trace->record.volumeMl, estimatedFinalVolumeMl)) : 1;

    char startTime[40]{};
    formatWaterRecordTime(trace->record, startTime, sizeof(startTime));
    const std::size_t traceBytes = sizeof(WaterPulseTrace) + trace->sampleCount * sizeof(WaterPulseTraceSample);
    char traceKb[24]{};
    formatKb(traceBytes, traceKb, sizeof(traceKb));
    const bool savedStoreReady = ensureSavedPulseTracesReady();
    WaterPulseTrace savedTraceForRecord{};
    const bool alreadySaved =
        savedStoreReady && g_context.savedPulseTraces->findByRecord(trace->record, savedTraceForRecord);
    const std::uint32_t traceActualMl = actualMlForSegmentedSample(*trace);
    const bool traceActualSynced = trace->actualMl > 0;
    const bool traceActualFromRecord = !traceActualSynced && traceActualMl > 0;
    const std::uint32_t detailVolumeMl = traceActualMl > 0 ? traceActualMl : trace->record.volumeMl;
    char averageFlowText[24]{};
    formatFlowLitersPerMin(recordFlowMlPerMin(detailVolumeMl, trace->record.durationSec),
                           averageFlowText,
                           sizeof(averageFlowText));
    Esp32BaseWeb::sendHeader("脉冲明细");
    sendFmt("<h2>脉冲明细</h2><div class='form-actions'><a class='btn-link' href='%s'>%s</a>",
            backHref,
            backLabel);
    if (savedSource || alreadySaved) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/faucet/records' onsubmit=\"return confirm('确认删除这条已保存的脉冲明细？')&&once(this)\">"
                                "<input type='hidden' name='action' value='delete'>");
        if (fromCalibration) {
            Esp32BaseWeb::sendChunk("<input type='hidden' name='returnTo' value='calibration'>");
        }
        sendFmt("<input type='hidden' name='trace' value='%lu'><input class='secondary' type='submit' value='删除已保存明细'></form>",
                static_cast<unsigned long>(savedSource ? trace->traceId : savedTraceForRecord.traceId));
    } else if (savedStoreReady) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/faucet/records' onsubmit=\"return once(this)\">"
                                "<input type='hidden' name='action' value='save'>");
        if (fromCalibration) {
            Esp32BaseWeb::sendChunk("<input type='hidden' name='returnTo' value='calibration'>");
        }
        sendFmt("<input type='hidden' name='trace' value='%lu'><input class='secondary' type='submit' value='保存明细'></form>",
                static_cast<unsigned long>(trace->traceId));
    } else {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>样本库不可用</span>");
    }
    Esp32BaseWeb::sendChunk("</div>");

