tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
bool readMeteringParamsFromRequest(MeteringParameters& params) {
    char text[32]{};
    return getParam("startupPulseCount", text, sizeof(text)) && parseU32(text, params.startupPulseCount) &&
           getParam("startupVolumeMl", text, sizeof(text)) && parseU32(text, params.startupVolumeMl) &&
           getParam("stablePulsePerLiter", text, sizeof(text)) && parseU32(text, params.stablePulsePerLiter) &&
           validMeteringSchemeParameters(params);
}

bool readMeteringSchemeId(std::uint32_t& id) {
    char text[32]{};
    return getParam("id", text, sizeof(text)) && parseU32(text, id) && id > 0;
}

void handleCreateMeteringSchemeApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=busy");
        return;
    }
    if (!ensureMeteringSchemesReady()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=save_failed");
        return;
    }
    MeteringParameters params{};
    if (!readMeteringParamsFromRequest(params)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=invalid_value");
        return;
    }
    char name[kMeteringSchemeNameLength]{};
    Esp32BaseWeb::getParam("name", name, sizeof(name));
    if (name[0] == '\0') {
        std::snprintf(name, sizeof(name), "手工方案");
    }
    std::uint32_t newId = 0;
    if (!g_context.meteringSchemes->createManual(name, params, g_context.nowSeconds ? g_context.nowSeconds() : 0, newId)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=save_failed");
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/calibration?saved=scheme_created");
}

void handleEditMeteringSchemeApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=busy");
        return;
    }
    if (!ensureMeteringSchemesReady()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=save_failed");
        return;
    }
    std::uint32_t id = 0;
    MeteringParameters params{};
    if (!readMeteringSchemeId(id) || !readMeteringParamsFromRequest(params)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=invalid_value");
        return;
    }
    MeteringSchemeRecord edited{};
    if (!g_context.meteringSchemes->findById(id, edited)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=invalid_value");
        return;
    }
    Esp32BaseWeb::getParam("name", edited.name, sizeof(edited.name));
    Esp32BaseWeb::getParam("meterLabel", edited.meterLabel, sizeof(edited.meterLabel));
    Esp32BaseWeb::getParam("installationLabel", edited.installationLabel, sizeof(edited.installationLabel));
    Esp32BaseWeb::getParam("conditionLabel", edited.conditionLabel, sizeof(edited.conditionLabel));
    Esp32BaseWeb::getParam("userNote", edited.userNote, sizeof(edited.userNote));
    edited.params = params;
    if (!g_context.meteringSchemes->updateScheme(edited, g_context.nowSeconds ? g_context.nowSeconds() : 0)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=save_failed");
        return;
    }
    if (id == g_context.meteringSchemes->activeSchemeId()) {
        MeteringSchemeRecord active{};
        if (g_context.meteringSchemes->activeScheme(active) && g_context.app) {
            g_context.app->applyActiveMeteringScheme(active);
        }
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/calibration?saved=scheme");
}

void handleEnableMeteringSchemeApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive() || !g_context.app || !g_context.app->canApplyConfig()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=busy");
        return;
    }
    if (!ensureMeteringSchemesReady()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=save_failed");
        return;
    }
    std::uint32_t id = 0;
    if (!readMeteringSchemeId(id)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=invalid_value");
        return;
    }
    if (!g_context.meteringSchemes->enableScheme(id, g_context.nowSeconds ? g_context.nowSeconds() : 0)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=save_failed");
        return;
    }
    MeteringSchemeRecord active{};
    if (!g_context.meteringSchemes->activeScheme(active) || !g_context.app->applyActiveMeteringScheme(active)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=save_failed");
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/calibration?saved=scheme_enabled");
}

void handleDisableMeteringSchemeApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=busy");
        return;
    }
    if (!ensureMeteringSchemesReady()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=save_failed");
        return;
    }
    std::uint32_t id = 0;
    if (!readMeteringSchemeId(id) || !g_context.meteringSchemes->disableScheme(id, g_context.nowSeconds ? g_context.nowSeconds() : 0)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration?error=invalid_value");
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/calibration?saved=scheme_disabled");
}

